/* automatically generated by rust-bindgen 0.70.1 */

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC23: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_TIME_BITS64: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C23_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 40;
pub const _SYS_CDEFS_H: u32 = 1;

pub const __LITTLE_ENDIAN: u32 = 1234;
pub const __BIG_ENDIAN: u32 = 4321;
pub const __PDP_ENDIAN: u32 = 3412;
pub const _BITS_ENDIANNESS_H: u32 = 1;
pub const __BYTE_ORDER: u32 = 1234;
pub const __FLOAT_WORD_ORDER: u32 = 1234;
pub const LITTLE_ENDIAN: u32 = 1234;
pub const BIG_ENDIAN: u32 = 4321;
pub const PDP_ENDIAN: u32 = 3412;
pub const BYTE_ORDER: u32 = 1234;
pub const _BITS_BYTESWAP_H: u32 = 1;
pub const _BITS_UINTN_IDENTITY_H: u32 = 1;
pub const _SYS_SELECT_H: u32 = 1;
pub const __sigset_t_defined: u32 = 1;
pub const __timeval_defined: u32 = 1;
pub const _STRUCT_TIMESPEC: u32 = 1;
pub const FD_SETSIZE: u32 = 1024;
pub const _BITS_PTHREADTYPES_COMMON_H: u32 = 1;
pub const _THREAD_SHARED_TYPES_H: u32 = 1;
pub const _BITS_PTHREADTYPES_ARCH_H: u32 = 1;
pub const __SIZEOF_PTHREAD_MUTEX_T: u32 = 40;
pub const __SIZEOF_PTHREAD_ATTR_T: u32 = 56;
pub const __SIZEOF_PTHREAD_RWLOCK_T: u32 = 56;
pub const __SIZEOF_PTHREAD_BARRIER_T: u32 = 32;
pub const __SIZEOF_PTHREAD_MUTEXATTR_T: u32 = 4;
pub const __SIZEOF_PTHREAD_COND_T: u32 = 48;
pub const __SIZEOF_PTHREAD_CONDATTR_T: u32 = 4;
pub const __SIZEOF_PTHREAD_RWLOCKATTR_T: u32 = 8;
pub const __SIZEOF_PTHREAD_BARRIERATTR_T: u32 = 4;
pub const _THREAD_MUTEX_INTERNAL_H: u32 = 1;
pub const __PTHREAD_MUTEX_HAVE_PREV: u32 = 1;
pub const __have_pthread_attr_t: u32 = 1;
pub const _ALLOCA_H: u32 = 1;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub const debugType_e_DEBUG_NONE: debugType_e = 0;
pub const debugType_e_DEBUG_CYCLETIME: debugType_e = 1;
pub const debugType_e_DEBUG_BATTERY: debugType_e = 2;
pub const debugType_e_DEBUG_GYRO_FILTERED: debugType_e = 3;
pub const debugType_e_DEBUG_ACCELEROMETER: debugType_e = 4;
pub const debugType_e_DEBUG_PIDLOOP: debugType_e = 5;
pub const debugType_e_DEBUG_GYRO_SCALED: debugType_e = 6;
pub const debugType_e_DEBUG_RC_INTERPOLATION: debugType_e = 7;
pub const debugType_e_DEBUG_ANGLERATE: debugType_e = 8;
pub const debugType_e_DEBUG_ESC_SENSOR: debugType_e = 9;
pub const debugType_e_DEBUG_SCHEDULER: debugType_e = 10;
pub const debugType_e_DEBUG_STACK: debugType_e = 11;
pub const debugType_e_DEBUG_ESC_SENSOR_RPM: debugType_e = 12;
pub const debugType_e_DEBUG_ESC_SENSOR_TMP: debugType_e = 13;
pub const debugType_e_DEBUG_ALTITUDE: debugType_e = 14;
pub const debugType_e_DEBUG_FFT: debugType_e = 15;
pub const debugType_e_DEBUG_FFT_TIME: debugType_e = 16;
pub const debugType_e_DEBUG_FFT_FREQ: debugType_e = 17;
pub const debugType_e_DEBUG_RX_FRSKY_SPI: debugType_e = 18;
pub const debugType_e_DEBUG_RX_SFHSS_SPI: debugType_e = 19;
pub const debugType_e_DEBUG_GYRO_RAW: debugType_e = 20;
pub const debugType_e_DEBUG_DUAL_GYRO_RAW: debugType_e = 21;
pub const debugType_e_DEBUG_DUAL_GYRO_DIFF: debugType_e = 22;
pub const debugType_e_DEBUG_MAX7456_SIGNAL: debugType_e = 23;
pub const debugType_e_DEBUG_MAX7456_SPICLOCK: debugType_e = 24;
pub const debugType_e_DEBUG_SBUS: debugType_e = 25;
pub const debugType_e_DEBUG_FPORT: debugType_e = 26;
pub const debugType_e_DEBUG_RANGEFINDER: debugType_e = 27;
pub const debugType_e_DEBUG_RANGEFINDER_QUALITY: debugType_e = 28;
pub const debugType_e_DEBUG_LIDAR_TF: debugType_e = 29;
pub const debugType_e_DEBUG_ADC_INTERNAL: debugType_e = 30;
pub const debugType_e_DEBUG_RUNAWAY_TAKEOFF: debugType_e = 31;
pub const debugType_e_DEBUG_SDIO: debugType_e = 32;
pub const debugType_e_DEBUG_CURRENT_SENSOR: debugType_e = 33;
pub const debugType_e_DEBUG_USB: debugType_e = 34;
pub const debugType_e_DEBUG_SMARTAUDIO: debugType_e = 35;
pub const debugType_e_DEBUG_RTH: debugType_e = 36;
pub const debugType_e_DEBUG_ITERM_RELAX: debugType_e = 37;
pub const debugType_e_DEBUG_ACRO_TRAINER: debugType_e = 38;
pub const debugType_e_DEBUG_RC_SMOOTHING: debugType_e = 39;
pub const debugType_e_DEBUG_RX_SIGNAL_LOSS: debugType_e = 40;
pub const debugType_e_DEBUG_RC_SMOOTHING_RATE: debugType_e = 41;
pub const debugType_e_DEBUG_ANTI_GRAVITY: debugType_e = 42;
pub const debugType_e_DEBUG_DYN_LPF: debugType_e = 43;
pub const debugType_e_DEBUG_RX_SPEKTRUM_SPI: debugType_e = 44;
pub const debugType_e_DEBUG_DSHOT_RPM_TELEMETRY: debugType_e = 45;
pub const debugType_e_DEBUG_RPM_FILTER: debugType_e = 46;
pub const debugType_e_DEBUG_D_MIN: debugType_e = 47;
pub const debugType_e_DEBUG_AC_CORRECTION: debugType_e = 48;
pub const debugType_e_DEBUG_AC_ERROR: debugType_e = 49;
pub const debugType_e_DEBUG_DUAL_GYRO_SCALED: debugType_e = 50;
pub const debugType_e_DEBUG_DSHOT_RPM_ERRORS: debugType_e = 51;
pub const debugType_e_DEBUG_CRSF_LINK_STATISTICS_UPLINK: debugType_e = 52;
pub const debugType_e_DEBUG_CRSF_LINK_STATISTICS_PWR: debugType_e = 53;
pub const debugType_e_DEBUG_CRSF_LINK_STATISTICS_DOWN: debugType_e = 54;
pub const debugType_e_DEBUG_BARO: debugType_e = 55;
pub const debugType_e_DEBUG_GPS_RESCUE_THROTTLE_PID: debugType_e = 56;
pub const debugType_e_DEBUG_DYN_IDLE: debugType_e = 57;
pub const debugType_e_DEBUG_FEEDFORWARD_LIMIT: debugType_e = 58;
pub const debugType_e_DEBUG_FEEDFORWARD: debugType_e = 59;
pub const debugType_e_DEBUG_BLACKBOX_OUTPUT: debugType_e = 60;
pub const debugType_e_DEBUG_GYRO_SAMPLE: debugType_e = 61;
pub const debugType_e_DEBUG_RX_TIMING: debugType_e = 62;
pub const debugType_e_DEBUG_D_LPF: debugType_e = 63;
pub const debugType_e_DEBUG_VTX_TRAMP: debugType_e = 64;
pub const debugType_e_DEBUG_GHST: debugType_e = 65;
pub const debugType_e_DEBUG_GHST_MSP: debugType_e = 66;
pub const debugType_e_DEBUG_SCHEDULER_DETERMINISM: debugType_e = 67;
pub const debugType_e_DEBUG_TIMING_ACCURACY: debugType_e = 68;
pub const debugType_e_DEBUG_RX_EXPRESSLRS_SPI: debugType_e = 69;
pub const debugType_e_DEBUG_RX_EXPRESSLRS_PHASELOCK: debugType_e = 70;
pub const debugType_e_DEBUG_RX_STATE_TIME: debugType_e = 71;
pub const debugType_e_DEBUG_GPS_RESCUE_VELOCITY: debugType_e = 72;
pub const debugType_e_DEBUG_GPS_RESCUE_HEADING: debugType_e = 73;
pub const debugType_e_DEBUG_GPS_RESCUE_TRACKING: debugType_e = 74;
pub const debugType_e_DEBUG_GPS_CONNECTION: debugType_e = 75;
pub const debugType_e_DEBUG_ATTITUDE: debugType_e = 76;
pub const debugType_e_DEBUG_VTX_MSP: debugType_e = 77;
pub const debugType_e_DEBUG_GPS_DOP: debugType_e = 78;
pub const debugType_e_DEBUG_FAILSAFE: debugType_e = 79;
pub const debugType_e_DEBUG_GYRO_CALIBRATION: debugType_e = 80;
pub const debugType_e_DEBUG_ANGLE_MODE: debugType_e = 81;
pub const debugType_e_DEBUG_ANGLE_TARGET: debugType_e = 82;
pub const debugType_e_DEBUG_CURRENT_ANGLE: debugType_e = 83;
pub const debugType_e_DEBUG_DSHOT_TELEMETRY_COUNTS: debugType_e = 84;
pub const debugType_e_DEBUG_RPM_LIMIT: debugType_e = 85;
pub const debugType_e_DEBUG_RC_STATS: debugType_e = 86;
pub const debugType_e_DEBUG_MAG_CALIB: debugType_e = 87;
pub const debugType_e_DEBUG_MAG_TASK_RATE: debugType_e = 88;
pub const debugType_e_DEBUG_EZLANDING: debugType_e = 89;
pub const debugType_e_DEBUG_SIM: debugType_e = 90;
pub const debugType_e_DEBUG_COUNT: debugType_e = 91;
pub type debugType_e = ::std::os::raw::c_uint;
pub type fix12_t = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stdev_s {
    pub m_oldM: f32,
    pub m_newM: f32,
    pub m_oldS: f32,
    pub m_newS: f32,
    pub m_n: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of stdev_s"][::std::mem::size_of::<stdev_s>() - 20usize];
    ["Alignment of stdev_s"][::std::mem::align_of::<stdev_s>() - 4usize];
    ["Offset of field: stdev_s::m_oldM"][::std::mem::offset_of!(stdev_s, m_oldM) - 0usize];
    ["Offset of field: stdev_s::m_newM"][::std::mem::offset_of!(stdev_s, m_newM) - 4usize];
    ["Offset of field: stdev_s::m_oldS"][::std::mem::offset_of!(stdev_s, m_oldS) - 8usize];
    ["Offset of field: stdev_s::m_newS"][::std::mem::offset_of!(stdev_s, m_newS) - 12usize];
    ["Offset of field: stdev_s::m_n"][::std::mem::offset_of!(stdev_s, m_n) - 16usize];
};
pub type stdev_t = stdev_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fp_vector {
    pub X: f32,
    pub Y: f32,
    pub Z: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fp_vector"][::std::mem::size_of::<fp_vector>() - 12usize];
    ["Alignment of fp_vector"][::std::mem::align_of::<fp_vector>() - 4usize];
    ["Offset of field: fp_vector::X"][::std::mem::offset_of!(fp_vector, X) - 0usize];
    ["Offset of field: fp_vector::Y"][::std::mem::offset_of!(fp_vector, Y) - 4usize];
    ["Offset of field: fp_vector::Z"][::std::mem::offset_of!(fp_vector, Z) - 8usize];
};
pub type t_fp_vector_def = fp_vector;
#[repr(C)]
#[derive(Copy, Clone)]
pub union u_fp_vector {
    pub A: [f32; 3usize],
    pub V: t_fp_vector_def,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of u_fp_vector"][::std::mem::size_of::<u_fp_vector>() - 12usize];
    ["Alignment of u_fp_vector"][::std::mem::align_of::<u_fp_vector>() - 4usize];
    ["Offset of field: u_fp_vector::A"][::std::mem::offset_of!(u_fp_vector, A) - 0usize];
    ["Offset of field: u_fp_vector::V"][::std::mem::offset_of!(u_fp_vector, V) - 0usize];
};
pub type t_fp_vector = u_fp_vector;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fp_angles {
    pub roll: f32,
    pub pitch: f32,
    pub yaw: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fp_angles"][::std::mem::size_of::<fp_angles>() - 12usize];
    ["Alignment of fp_angles"][::std::mem::align_of::<fp_angles>() - 4usize];
    ["Offset of field: fp_angles::roll"][::std::mem::offset_of!(fp_angles, roll) - 0usize];
    ["Offset of field: fp_angles::pitch"][::std::mem::offset_of!(fp_angles, pitch) - 4usize];
    ["Offset of field: fp_angles::yaw"][::std::mem::offset_of!(fp_angles, yaw) - 8usize];
};
pub type fp_angles_def = fp_angles;
#[repr(C)]
#[derive(Copy, Clone)]
pub union fp_angles_t {
    pub raw: [f32; 3usize],
    pub angles: fp_angles_def,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fp_angles_t"][::std::mem::size_of::<fp_angles_t>() - 12usize];
    ["Alignment of fp_angles_t"][::std::mem::align_of::<fp_angles_t>() - 4usize];
    ["Offset of field: fp_angles_t::raw"][::std::mem::offset_of!(fp_angles_t, raw) - 0usize];
    ["Offset of field: fp_angles_t::angles"][::std::mem::offset_of!(fp_angles_t, angles) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fp_rotationMatrix_s {
    pub m: [[f32; 3usize]; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fp_rotationMatrix_s"][::std::mem::size_of::<fp_rotationMatrix_s>() - 36usize];
    ["Alignment of fp_rotationMatrix_s"][::std::mem::align_of::<fp_rotationMatrix_s>() - 4usize];
    ["Offset of field: fp_rotationMatrix_s::m"]
        [::std::mem::offset_of!(fp_rotationMatrix_s, m) - 0usize];
};
pub type fp_rotationMatrix_t = fp_rotationMatrix_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct accDev_s {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gyroDev_s {
    _unused: [u8; 0],
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::std::mem::size_of::<__locale_struct>() - 232usize];
    ["Alignment of __locale_struct"][::std::mem::align_of::<__locale_struct>() - 8usize];
    ["Offset of field: __locale_struct::__locales"]
        [::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::std::mem::offset_of!(__locale_struct, __ctype_b) - 104usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 112usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 120usize];
    ["Offset of field: __locale_struct::__names"]
        [::std::mem::offset_of!(__locale_struct, __names) - 128usize];
};
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
pub const GPIO_Mode_Mode_TEST: GPIO_Mode = 0;
pub const GPIO_Mode_Mode_Out_PP: GPIO_Mode = 16;
pub type GPIO_Mode = ::std::os::raw::c_uint;
pub const FlagStatus_RESET: FlagStatus = 0;
pub const FlagStatus_SET: FlagStatus = 1;
pub type FlagStatus = ::std::os::raw::c_uint;
pub use self::FlagStatus as ITStatus;
pub const FunctionalState_DISABLE: FunctionalState = 0;
pub const FunctionalState_ENABLE: FunctionalState = 1;
pub type FunctionalState = ::std::os::raw::c_uint;
pub const IRQn_Type_TEST_IRQ: IRQn_Type = 0;
pub type IRQn_Type = ::std::os::raw::c_uint;
pub const EXTITrigger_TypeDef_EXTI_Trigger_Rising: EXTITrigger_TypeDef = 8;
pub const EXTITrigger_TypeDef_EXTI_Trigger_Falling: EXTITrigger_TypeDef = 12;
pub const EXTITrigger_TypeDef_EXTI_Trigger_Rising_Falling: EXTITrigger_TypeDef = 16;
pub type EXTITrigger_TypeDef = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GPIO_TypeDef {
    pub IDR: u32,
    pub ODR: u32,
    pub BSRR: u32,
    pub BRR: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GPIO_TypeDef"][::std::mem::size_of::<GPIO_TypeDef>() - 16usize];
    ["Alignment of GPIO_TypeDef"][::std::mem::align_of::<GPIO_TypeDef>() - 4usize];
    ["Offset of field: GPIO_TypeDef::IDR"][::std::mem::offset_of!(GPIO_TypeDef, IDR) - 0usize];
    ["Offset of field: GPIO_TypeDef::ODR"][::std::mem::offset_of!(GPIO_TypeDef, ODR) - 4usize];
    ["Offset of field: GPIO_TypeDef::BSRR"][::std::mem::offset_of!(GPIO_TypeDef, BSRR) - 8usize];
    ["Offset of field: GPIO_TypeDef::BRR"][::std::mem::offset_of!(GPIO_TypeDef, BRR) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TIM_TypeDef {
    pub test: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TIM_TypeDef"][::std::mem::size_of::<TIM_TypeDef>() - 8usize];
    ["Alignment of TIM_TypeDef"][::std::mem::align_of::<TIM_TypeDef>() - 8usize];
    ["Offset of field: TIM_TypeDef::test"][::std::mem::offset_of!(TIM_TypeDef, test) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TIM_OCInitTypeDef {
    pub test: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TIM_OCInitTypeDef"][::std::mem::size_of::<TIM_OCInitTypeDef>() - 8usize];
    ["Alignment of TIM_OCInitTypeDef"][::std::mem::align_of::<TIM_OCInitTypeDef>() - 8usize];
    ["Offset of field: TIM_OCInitTypeDef::test"]
        [::std::mem::offset_of!(TIM_OCInitTypeDef, test) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DMA_TypeDef {
    pub test: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DMA_TypeDef"][::std::mem::size_of::<DMA_TypeDef>() - 8usize];
    ["Alignment of DMA_TypeDef"][::std::mem::align_of::<DMA_TypeDef>() - 8usize];
    ["Offset of field: DMA_TypeDef::test"][::std::mem::offset_of!(DMA_TypeDef, test) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DMA_Channel_TypeDef {
    pub test: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DMA_Channel_TypeDef"][::std::mem::size_of::<DMA_Channel_TypeDef>() - 8usize];
    ["Alignment of DMA_Channel_TypeDef"][::std::mem::align_of::<DMA_Channel_TypeDef>() - 8usize];
    ["Offset of field: DMA_Channel_TypeDef::test"]
        [::std::mem::offset_of!(DMA_Channel_TypeDef, test) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DMA_InitTypeDef {
    pub test: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DMA_InitTypeDef"][::std::mem::size_of::<DMA_InitTypeDef>() - 8usize];
    ["Alignment of DMA_InitTypeDef"][::std::mem::align_of::<DMA_InitTypeDef>() - 8usize];
    ["Offset of field: DMA_InitTypeDef::test"]
        [::std::mem::offset_of!(DMA_InitTypeDef, test) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SPI_TypeDef {
    pub test: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SPI_TypeDef"][::std::mem::size_of::<SPI_TypeDef>() - 8usize];
    ["Alignment of SPI_TypeDef"][::std::mem::align_of::<SPI_TypeDef>() - 8usize];
    ["Offset of field: SPI_TypeDef::test"][::std::mem::offset_of!(SPI_TypeDef, test) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct USART_TypeDef {
    pub test: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of USART_TypeDef"][::std::mem::size_of::<USART_TypeDef>() - 8usize];
    ["Alignment of USART_TypeDef"][::std::mem::align_of::<USART_TypeDef>() - 8usize];
    ["Offset of field: USART_TypeDef::test"][::std::mem::offset_of!(USART_TypeDef, test) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TIM_ICInitTypeDef {
    #[doc = "< Specifies the TIM channel.\nThis parameter can be a value of @ref TIM_Channel"]
    pub TIM_Channel: u16,
    #[doc = "< Specifies the active edge of the input signal.\nThis parameter can be a value of @ref\nTIM_Input_Capture_Polarity"]
    pub TIM_ICPolarity: u16,
    #[doc = "< Specifies the input.\nThis parameter can be a value of @ref\nTIM_Input_Capture_Selection"]
    pub TIM_ICSelection: u16,
    #[doc = "< Specifies the Input Capture Prescaler.\nThis parameter can be a value of @ref\nTIM_Input_Capture_Prescaler"]
    pub TIM_ICPrescaler: u16,
    #[doc = "< Specifies the input capture filter.\nThis parameter can be a number between 0x0 and 0xF"]
    pub TIM_ICFilter: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TIM_ICInitTypeDef"][::std::mem::size_of::<TIM_ICInitTypeDef>() - 10usize];
    ["Alignment of TIM_ICInitTypeDef"][::std::mem::align_of::<TIM_ICInitTypeDef>() - 2usize];
    ["Offset of field: TIM_ICInitTypeDef::TIM_Channel"]
        [::std::mem::offset_of!(TIM_ICInitTypeDef, TIM_Channel) - 0usize];
    ["Offset of field: TIM_ICInitTypeDef::TIM_ICPolarity"]
        [::std::mem::offset_of!(TIM_ICInitTypeDef, TIM_ICPolarity) - 2usize];
    ["Offset of field: TIM_ICInitTypeDef::TIM_ICSelection"]
        [::std::mem::offset_of!(TIM_ICInitTypeDef, TIM_ICSelection) - 4usize];
    ["Offset of field: TIM_ICInitTypeDef::TIM_ICPrescaler"]
        [::std::mem::offset_of!(TIM_ICInitTypeDef, TIM_ICPrescaler) - 6usize];
    ["Offset of field: TIM_ICInitTypeDef::TIM_ICFilter"]
        [::std::mem::offset_of!(TIM_ICInitTypeDef, TIM_ICFilter) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct I2C_TypeDef {
    pub test: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of I2C_TypeDef"][::std::mem::size_of::<I2C_TypeDef>() - 8usize];
    ["Alignment of I2C_TypeDef"][::std::mem::align_of::<I2C_TypeDef>() - 8usize];
    ["Offset of field: I2C_TypeDef::test"][::std::mem::offset_of!(I2C_TypeDef, test) - 0usize];
};
pub const FLASH_Status_FLASH_BUSY: FLASH_Status = 1;
pub const FLASH_Status_FLASH_ERROR_PG: FLASH_Status = 2;
pub const FLASH_Status_FLASH_ERROR_WRP: FLASH_Status = 3;
pub const FLASH_Status_FLASH_COMPLETE: FLASH_Status = 4;
pub const FLASH_Status_FLASH_TIMEOUT: FLASH_Status = 5;
pub type FLASH_Status = ::std::os::raw::c_uint;
pub const mcuTypeId_e_MCU_TYPE_SIMULATOR: mcuTypeId_e = 0;
pub const mcuTypeId_e_MCU_TYPE_F40X: mcuTypeId_e = 1;
pub const mcuTypeId_e_MCU_TYPE_F411: mcuTypeId_e = 2;
pub const mcuTypeId_e_MCU_TYPE_F446: mcuTypeId_e = 3;
pub const mcuTypeId_e_MCU_TYPE_F722: mcuTypeId_e = 4;
pub const mcuTypeId_e_MCU_TYPE_F745: mcuTypeId_e = 5;
pub const mcuTypeId_e_MCU_TYPE_F746: mcuTypeId_e = 6;
pub const mcuTypeId_e_MCU_TYPE_F765: mcuTypeId_e = 7;
pub const mcuTypeId_e_MCU_TYPE_H750: mcuTypeId_e = 8;
pub const mcuTypeId_e_MCU_TYPE_H743_REV_UNKNOWN: mcuTypeId_e = 9;
pub const mcuTypeId_e_MCU_TYPE_H743_REV_Y: mcuTypeId_e = 10;
pub const mcuTypeId_e_MCU_TYPE_H743_REV_X: mcuTypeId_e = 11;
pub const mcuTypeId_e_MCU_TYPE_H743_REV_V: mcuTypeId_e = 12;
pub const mcuTypeId_e_MCU_TYPE_H7A3: mcuTypeId_e = 13;
pub const mcuTypeId_e_MCU_TYPE_H723_725: mcuTypeId_e = 14;
pub const mcuTypeId_e_MCU_TYPE_G474: mcuTypeId_e = 15;
pub const mcuTypeId_e_MCU_TYPE_H730: mcuTypeId_e = 16;
pub const mcuTypeId_e_MCU_TYPE_AT32: mcuTypeId_e = 17;
pub const mcuTypeId_e_MCU_TYPE_UNKNOWN: mcuTypeId_e = 255;
pub type mcuTypeId_e = ::std::os::raw::c_uint;
pub type pgn_t = u16;
pub const pgRegistryFlags_e_PGRF_NONE: pgRegistryFlags_e = 0;
pub const pgRegistryFlags_e_PGRF_CLASSIFICATON_BIT: pgRegistryFlags_e = 1;
pub type pgRegistryFlags_e = ::std::os::raw::c_uint;
pub const pgRegistryInternal_e_PGR_PGN_MASK: pgRegistryInternal_e = 4095;
pub const pgRegistryInternal_e_PGR_PGN_VERSION_MASK: pgRegistryInternal_e = 61440;
pub const pgRegistryInternal_e_PGR_SIZE_MASK: pgRegistryInternal_e = 4095;
pub const pgRegistryInternal_e_PGR_SIZE_SYSTEM_FLAG: pgRegistryInternal_e = 0;
pub type pgRegistryInternal_e = ::std::os::raw::c_uint;
pub type pgResetFunc =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pgRegistry_s {
    pub pgn: pgn_t,
    pub length: u8,
    pub size: u16,
    pub address: *mut u8,
    pub copy: *mut u8,
    pub ptr: *mut *mut u8,
    pub reset: pgRegistry_s__bindgen_ty_1,
    pub fnv_hash: *mut u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pgRegistry_s__bindgen_ty_1 {
    pub ptr: *mut ::std::os::raw::c_void,
    pub fn_: pgResetFunc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pgRegistry_s__bindgen_ty_1"]
        [::std::mem::size_of::<pgRegistry_s__bindgen_ty_1>() - 8usize];
    ["Alignment of pgRegistry_s__bindgen_ty_1"]
        [::std::mem::align_of::<pgRegistry_s__bindgen_ty_1>() - 8usize];
    ["Offset of field: pgRegistry_s__bindgen_ty_1::ptr"]
        [::std::mem::offset_of!(pgRegistry_s__bindgen_ty_1, ptr) - 0usize];
    ["Offset of field: pgRegistry_s__bindgen_ty_1::fn_"]
        [::std::mem::offset_of!(pgRegistry_s__bindgen_ty_1, fn_) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pgRegistry_s"][::std::mem::size_of::<pgRegistry_s>() - 48usize];
    ["Alignment of pgRegistry_s"][::std::mem::align_of::<pgRegistry_s>() - 8usize];
    ["Offset of field: pgRegistry_s::pgn"][::std::mem::offset_of!(pgRegistry_s, pgn) - 0usize];
    ["Offset of field: pgRegistry_s::length"]
        [::std::mem::offset_of!(pgRegistry_s, length) - 2usize];
    ["Offset of field: pgRegistry_s::size"][::std::mem::offset_of!(pgRegistry_s, size) - 4usize];
    ["Offset of field: pgRegistry_s::address"]
        [::std::mem::offset_of!(pgRegistry_s, address) - 8usize];
    ["Offset of field: pgRegistry_s::copy"][::std::mem::offset_of!(pgRegistry_s, copy) - 16usize];
    ["Offset of field: pgRegistry_s::ptr"][::std::mem::offset_of!(pgRegistry_s, ptr) - 24usize];
    ["Offset of field: pgRegistry_s::reset"][::std::mem::offset_of!(pgRegistry_s, reset) - 32usize];
    ["Offset of field: pgRegistry_s::fnv_hash"]
        [::std::mem::offset_of!(pgRegistry_s, fnv_hash) - 40usize];
};
pub type pgRegistry_t = pgRegistry_s;
pub type timeDelta_t = i32;
pub type timeMs_t = u32;
pub type timeUs_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeConfig_s {
    pub tz_offsetMinutes: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeConfig_s"][::std::mem::size_of::<timeConfig_s>() - 2usize];
    ["Alignment of timeConfig_s"][::std::mem::align_of::<timeConfig_s>() - 2usize];
    ["Offset of field: timeConfig_s::tz_offsetMinutes"]
        [::std::mem::offset_of!(timeConfig_s, tz_offsetMinutes) - 0usize];
};
pub type timeConfig_t = timeConfig_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dummy {
    _unused: [u8; 0],
}
pub type rtcTime_t = i64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _dateTime_s {
    pub year: u16,
    pub month: u8,
    pub day: u8,
    pub hours: u8,
    pub minutes: u8,
    pub seconds: u8,
    pub millis: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _dateTime_s"][::std::mem::size_of::<_dateTime_s>() - 10usize];
    ["Alignment of _dateTime_s"][::std::mem::align_of::<_dateTime_s>() - 2usize];
    ["Offset of field: _dateTime_s::year"][::std::mem::offset_of!(_dateTime_s, year) - 0usize];
    ["Offset of field: _dateTime_s::month"][::std::mem::offset_of!(_dateTime_s, month) - 2usize];
    ["Offset of field: _dateTime_s::day"][::std::mem::offset_of!(_dateTime_s, day) - 3usize];
    ["Offset of field: _dateTime_s::hours"][::std::mem::offset_of!(_dateTime_s, hours) - 4usize];
    ["Offset of field: _dateTime_s::minutes"]
        [::std::mem::offset_of!(_dateTime_s, minutes) - 5usize];
    ["Offset of field: _dateTime_s::seconds"]
        [::std::mem::offset_of!(_dateTime_s, seconds) - 6usize];
    ["Offset of field: _dateTime_s::millis"][::std::mem::offset_of!(_dateTime_s, millis) - 8usize];
};
pub type dateTime_t = _dateTime_s;
pub const resourceOwner_e_OWNER_FREE: resourceOwner_e = 0;
pub const resourceOwner_e_OWNER_PWMINPUT: resourceOwner_e = 1;
pub const resourceOwner_e_OWNER_PPMINPUT: resourceOwner_e = 2;
pub const resourceOwner_e_OWNER_MOTOR: resourceOwner_e = 3;
pub const resourceOwner_e_OWNER_SERVO: resourceOwner_e = 4;
pub const resourceOwner_e_OWNER_LED: resourceOwner_e = 5;
pub const resourceOwner_e_OWNER_ADC: resourceOwner_e = 6;
pub const resourceOwner_e_OWNER_ADC_BATT: resourceOwner_e = 7;
pub const resourceOwner_e_OWNER_ADC_CURR: resourceOwner_e = 8;
pub const resourceOwner_e_OWNER_ADC_EXT: resourceOwner_e = 9;
pub const resourceOwner_e_OWNER_ADC_RSSI: resourceOwner_e = 10;
pub const resourceOwner_e_OWNER_SERIAL_TX: resourceOwner_e = 11;
pub const resourceOwner_e_OWNER_SERIAL_RX: resourceOwner_e = 12;
pub const resourceOwner_e_OWNER_PINDEBUG: resourceOwner_e = 13;
pub const resourceOwner_e_OWNER_TIMER: resourceOwner_e = 14;
pub const resourceOwner_e_OWNER_SONAR_TRIGGER: resourceOwner_e = 15;
pub const resourceOwner_e_OWNER_SONAR_ECHO: resourceOwner_e = 16;
pub const resourceOwner_e_OWNER_SYSTEM: resourceOwner_e = 17;
pub const resourceOwner_e_OWNER_SPI_SCK: resourceOwner_e = 18;
pub const resourceOwner_e_OWNER_SPI_SDI: resourceOwner_e = 19;
pub const resourceOwner_e_OWNER_SPI_SDO: resourceOwner_e = 20;
pub const resourceOwner_e_OWNER_I2C_SCL: resourceOwner_e = 21;
pub const resourceOwner_e_OWNER_I2C_SDA: resourceOwner_e = 22;
pub const resourceOwner_e_OWNER_SDCARD: resourceOwner_e = 23;
pub const resourceOwner_e_OWNER_SDIO_CK: resourceOwner_e = 24;
pub const resourceOwner_e_OWNER_SDIO_CMD: resourceOwner_e = 25;
pub const resourceOwner_e_OWNER_SDIO_D0: resourceOwner_e = 26;
pub const resourceOwner_e_OWNER_SDIO_D1: resourceOwner_e = 27;
pub const resourceOwner_e_OWNER_SDIO_D2: resourceOwner_e = 28;
pub const resourceOwner_e_OWNER_SDIO_D3: resourceOwner_e = 29;
pub const resourceOwner_e_OWNER_SDCARD_CS: resourceOwner_e = 30;
pub const resourceOwner_e_OWNER_SDCARD_DETECT: resourceOwner_e = 31;
pub const resourceOwner_e_OWNER_FLASH_CS: resourceOwner_e = 32;
pub const resourceOwner_e_OWNER_BARO_CS: resourceOwner_e = 33;
pub const resourceOwner_e_OWNER_GYRO_CS: resourceOwner_e = 34;
pub const resourceOwner_e_OWNER_OSD_CS: resourceOwner_e = 35;
pub const resourceOwner_e_OWNER_RX_SPI_CS: resourceOwner_e = 36;
pub const resourceOwner_e_OWNER_SPI_CS: resourceOwner_e = 37;
pub const resourceOwner_e_OWNER_GYRO_EXTI: resourceOwner_e = 38;
pub const resourceOwner_e_OWNER_BARO_EOC: resourceOwner_e = 39;
pub const resourceOwner_e_OWNER_COMPASS_EXTI: resourceOwner_e = 40;
pub const resourceOwner_e_OWNER_USB: resourceOwner_e = 41;
pub const resourceOwner_e_OWNER_USB_DETECT: resourceOwner_e = 42;
pub const resourceOwner_e_OWNER_BEEPER: resourceOwner_e = 43;
pub const resourceOwner_e_OWNER_OSD: resourceOwner_e = 44;
pub const resourceOwner_e_OWNER_RX_BIND: resourceOwner_e = 45;
pub const resourceOwner_e_OWNER_INVERTER: resourceOwner_e = 46;
pub const resourceOwner_e_OWNER_LED_STRIP: resourceOwner_e = 47;
pub const resourceOwner_e_OWNER_TRANSPONDER: resourceOwner_e = 48;
pub const resourceOwner_e_OWNER_VTX_POWER: resourceOwner_e = 49;
pub const resourceOwner_e_OWNER_VTX_CS: resourceOwner_e = 50;
pub const resourceOwner_e_OWNER_VTX_DATA: resourceOwner_e = 51;
pub const resourceOwner_e_OWNER_VTX_CLK: resourceOwner_e = 52;
pub const resourceOwner_e_OWNER_COMPASS_CS: resourceOwner_e = 53;
pub const resourceOwner_e_OWNER_RX_BIND_PLUG: resourceOwner_e = 54;
pub const resourceOwner_e_OWNER_ESCSERIAL: resourceOwner_e = 55;
pub const resourceOwner_e_OWNER_CAMERA_CONTROL: resourceOwner_e = 56;
pub const resourceOwner_e_OWNER_TIMUP: resourceOwner_e = 57;
pub const resourceOwner_e_OWNER_RANGEFINDER: resourceOwner_e = 58;
pub const resourceOwner_e_OWNER_RX_SPI: resourceOwner_e = 59;
pub const resourceOwner_e_OWNER_PINIO: resourceOwner_e = 60;
pub const resourceOwner_e_OWNER_USB_MSC_PIN: resourceOwner_e = 61;
pub const resourceOwner_e_OWNER_MCO: resourceOwner_e = 62;
pub const resourceOwner_e_OWNER_RX_SPI_BIND: resourceOwner_e = 63;
pub const resourceOwner_e_OWNER_RX_SPI_LED: resourceOwner_e = 64;
pub const resourceOwner_e_OWNER_PREINIT: resourceOwner_e = 65;
pub const resourceOwner_e_OWNER_RX_SPI_EXTI: resourceOwner_e = 66;
pub const resourceOwner_e_OWNER_RX_SPI_CC2500_TX_EN: resourceOwner_e = 67;
pub const resourceOwner_e_OWNER_RX_SPI_CC2500_LNA_EN: resourceOwner_e = 68;
pub const resourceOwner_e_OWNER_RX_SPI_CC2500_ANT_SEL: resourceOwner_e = 69;
pub const resourceOwner_e_OWNER_QUADSPI_CLK: resourceOwner_e = 70;
pub const resourceOwner_e_OWNER_QUADSPI_BK1IO0: resourceOwner_e = 71;
pub const resourceOwner_e_OWNER_QUADSPI_BK1IO1: resourceOwner_e = 72;
pub const resourceOwner_e_OWNER_QUADSPI_BK1IO2: resourceOwner_e = 73;
pub const resourceOwner_e_OWNER_QUADSPI_BK1IO3: resourceOwner_e = 74;
pub const resourceOwner_e_OWNER_QUADSPI_BK1CS: resourceOwner_e = 75;
pub const resourceOwner_e_OWNER_QUADSPI_BK2IO0: resourceOwner_e = 76;
pub const resourceOwner_e_OWNER_QUADSPI_BK2IO1: resourceOwner_e = 77;
pub const resourceOwner_e_OWNER_QUADSPI_BK2IO2: resourceOwner_e = 78;
pub const resourceOwner_e_OWNER_QUADSPI_BK2IO3: resourceOwner_e = 79;
pub const resourceOwner_e_OWNER_QUADSPI_BK2CS: resourceOwner_e = 80;
pub const resourceOwner_e_OWNER_BARO_XCLR: resourceOwner_e = 81;
pub const resourceOwner_e_OWNER_PULLUP: resourceOwner_e = 82;
pub const resourceOwner_e_OWNER_PULLDOWN: resourceOwner_e = 83;
pub const resourceOwner_e_OWNER_DSHOT_BITBANG: resourceOwner_e = 84;
pub const resourceOwner_e_OWNER_SWD: resourceOwner_e = 85;
pub const resourceOwner_e_OWNER_RX_SPI_EXPRESSLRS_RESET: resourceOwner_e = 86;
pub const resourceOwner_e_OWNER_RX_SPI_EXPRESSLRS_BUSY: resourceOwner_e = 87;
pub const resourceOwner_e_OWNER_SOFTSERIAL_TX: resourceOwner_e = 88;
pub const resourceOwner_e_OWNER_SOFTSERIAL_RX: resourceOwner_e = 89;
pub const resourceOwner_e_OWNER_TOTAL_COUNT: resourceOwner_e = 90;
pub type resourceOwner_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct resourceOwner_s {
    pub owner: resourceOwner_e,
    pub resourceIndex: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of resourceOwner_s"][::std::mem::size_of::<resourceOwner_s>() - 8usize];
    ["Alignment of resourceOwner_s"][::std::mem::align_of::<resourceOwner_s>() - 4usize];
    ["Offset of field: resourceOwner_s::owner"]
        [::std::mem::offset_of!(resourceOwner_s, owner) - 0usize];
    ["Offset of field: resourceOwner_s::resourceIndex"]
        [::std::mem::offset_of!(resourceOwner_s, resourceIndex) - 4usize];
};
pub type resourceOwner_t = resourceOwner_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dmaResource_s {
    _unused: [u8; 0],
}
pub type dmaResource_t = dmaResource_s;
pub type dmaCallbackHandlerFuncPtr =
    ::std::option::Option<unsafe extern "C" fn(channelDescriptor: *mut dmaChannelDescriptor_s)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dmaChannelDescriptor_s {
    pub dma: *mut DMA_TypeDef,
    pub ref_: *mut dmaResource_t,
    pub channel: u32,
    pub irqHandlerCallback: dmaCallbackHandlerFuncPtr,
    pub flagsShift: u8,
    pub irqN: IRQn_Type,
    pub userParam: u32,
    pub owner: resourceOwner_t,
    pub resourceIndex: u8,
    pub completeFlag: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dmaChannelDescriptor_s"][::std::mem::size_of::<dmaChannelDescriptor_s>() - 64usize];
    ["Alignment of dmaChannelDescriptor_s"]
        [::std::mem::align_of::<dmaChannelDescriptor_s>() - 8usize];
    ["Offset of field: dmaChannelDescriptor_s::dma"]
        [::std::mem::offset_of!(dmaChannelDescriptor_s, dma) - 0usize];
    ["Offset of field: dmaChannelDescriptor_s::ref_"]
        [::std::mem::offset_of!(dmaChannelDescriptor_s, ref_) - 8usize];
    ["Offset of field: dmaChannelDescriptor_s::channel"]
        [::std::mem::offset_of!(dmaChannelDescriptor_s, channel) - 16usize];
    ["Offset of field: dmaChannelDescriptor_s::irqHandlerCallback"]
        [::std::mem::offset_of!(dmaChannelDescriptor_s, irqHandlerCallback) - 24usize];
    ["Offset of field: dmaChannelDescriptor_s::flagsShift"]
        [::std::mem::offset_of!(dmaChannelDescriptor_s, flagsShift) - 32usize];
    ["Offset of field: dmaChannelDescriptor_s::irqN"]
        [::std::mem::offset_of!(dmaChannelDescriptor_s, irqN) - 36usize];
    ["Offset of field: dmaChannelDescriptor_s::userParam"]
        [::std::mem::offset_of!(dmaChannelDescriptor_s, userParam) - 40usize];
    ["Offset of field: dmaChannelDescriptor_s::owner"]
        [::std::mem::offset_of!(dmaChannelDescriptor_s, owner) - 44usize];
    ["Offset of field: dmaChannelDescriptor_s::resourceIndex"]
        [::std::mem::offset_of!(dmaChannelDescriptor_s, resourceIndex) - 52usize];
    ["Offset of field: dmaChannelDescriptor_s::completeFlag"]
        [::std::mem::offset_of!(dmaChannelDescriptor_s, completeFlag) - 56usize];
};
pub type dmaChannelDescriptor_t = dmaChannelDescriptor_s;
pub const dmaIdentifier_e_DMA_NONE: dmaIdentifier_e = 0;
pub const dmaIdentifier_e_DMA1_CH1_HANDLER: dmaIdentifier_e = 1;
pub const dmaIdentifier_e_DMA1_CH2_HANDLER: dmaIdentifier_e = 2;
pub const dmaIdentifier_e_DMA1_CH3_HANDLER: dmaIdentifier_e = 3;
pub const dmaIdentifier_e_DMA1_CH4_HANDLER: dmaIdentifier_e = 4;
pub const dmaIdentifier_e_DMA1_CH5_HANDLER: dmaIdentifier_e = 5;
pub const dmaIdentifier_e_DMA1_CH6_HANDLER: dmaIdentifier_e = 6;
pub const dmaIdentifier_e_DMA1_CH7_HANDLER: dmaIdentifier_e = 7;
pub const dmaIdentifier_e_DMA_LAST_HANDLER: dmaIdentifier_e = 7;
pub type dmaIdentifier_e = ::std::os::raw::c_uint;
pub type ioTag_t = u8;
pub type IO_t = *mut ::std::os::raw::c_void;
pub type ioConfig_t = u8;
pub type IOTraverseFuncPtr_t = ::std::option::Option<unsafe extern "C" fn(io: IO_t)>;
pub type rccPeriphTag_t = u8;
pub type dmaCode_t = u16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dmaChannelSpec_s {
    pub code: dmaCode_t,
    pub ref_: *mut dmaResource_t,
    pub channel: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of dmaChannelSpec_s"][::std::mem::size_of::<dmaChannelSpec_s>() - 24usize];
    ["Alignment of dmaChannelSpec_s"][::std::mem::align_of::<dmaChannelSpec_s>() - 8usize];
    ["Offset of field: dmaChannelSpec_s::code"]
        [::std::mem::offset_of!(dmaChannelSpec_s, code) - 0usize];
    ["Offset of field: dmaChannelSpec_s::ref_"]
        [::std::mem::offset_of!(dmaChannelSpec_s, ref_) - 8usize];
    ["Offset of field: dmaChannelSpec_s::channel"]
        [::std::mem::offset_of!(dmaChannelSpec_s, channel) - 16usize];
};
pub type dmaChannelSpec_t = dmaChannelSpec_s;
pub const dmaPeripheral_e_DMA_PERIPH_SPI_SDO: dmaPeripheral_e = 0;
pub const dmaPeripheral_e_DMA_PERIPH_SPI_SDI: dmaPeripheral_e = 1;
pub const dmaPeripheral_e_DMA_PERIPH_ADC: dmaPeripheral_e = 2;
pub const dmaPeripheral_e_DMA_PERIPH_SDIO: dmaPeripheral_e = 3;
pub const dmaPeripheral_e_DMA_PERIPH_UART_TX: dmaPeripheral_e = 4;
pub const dmaPeripheral_e_DMA_PERIPH_UART_RX: dmaPeripheral_e = 5;
pub const dmaPeripheral_e_DMA_PERIPH_TIMUP: dmaPeripheral_e = 6;
pub type dmaPeripheral_e = ::std::os::raw::c_uint;
pub type dmaoptValue_t = i8;
pub type captureCompare_t = u16;
pub type timCCR_t = u32;
pub type timCCER_t = u32;
pub type timSR_t = u32;
pub type timCNT_t = u32;
pub type timerCCHandlerCallback =
    ::std::option::Option<unsafe extern "C" fn(self_: *mut timerCCHandlerRec_s, capture: u16)>;
pub type timerOvrHandlerCallback =
    ::std::option::Option<unsafe extern "C" fn(self_: *mut timerOvrHandlerRec_s, capture: u16)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timerCCHandlerRec_s {
    pub fn_: timerCCHandlerCallback,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timerCCHandlerRec_s"][::std::mem::size_of::<timerCCHandlerRec_s>() - 8usize];
    ["Alignment of timerCCHandlerRec_s"][::std::mem::align_of::<timerCCHandlerRec_s>() - 8usize];
    ["Offset of field: timerCCHandlerRec_s::fn_"]
        [::std::mem::offset_of!(timerCCHandlerRec_s, fn_) - 0usize];
};
pub type timerCCHandlerRec_t = timerCCHandlerRec_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timerOvrHandlerRec_s {
    pub fn_: timerOvrHandlerCallback,
    pub next: *mut timerOvrHandlerRec_s,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timerOvrHandlerRec_s"][::std::mem::size_of::<timerOvrHandlerRec_s>() - 16usize];
    ["Alignment of timerOvrHandlerRec_s"][::std::mem::align_of::<timerOvrHandlerRec_s>() - 8usize];
    ["Offset of field: timerOvrHandlerRec_s::fn_"]
        [::std::mem::offset_of!(timerOvrHandlerRec_s, fn_) - 0usize];
    ["Offset of field: timerOvrHandlerRec_s::next"]
        [::std::mem::offset_of!(timerOvrHandlerRec_s, next) - 8usize];
};
pub type timerOvrHandlerRec_t = timerOvrHandlerRec_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timerDef_s {
    pub TIMx: *mut TIM_TypeDef,
    pub rcc: rccPeriphTag_t,
    pub inputIrq: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timerDef_s"][::std::mem::size_of::<timerDef_s>() - 16usize];
    ["Alignment of timerDef_s"][::std::mem::align_of::<timerDef_s>() - 8usize];
    ["Offset of field: timerDef_s::TIMx"][::std::mem::offset_of!(timerDef_s, TIMx) - 0usize];
    ["Offset of field: timerDef_s::rcc"][::std::mem::offset_of!(timerDef_s, rcc) - 8usize];
    ["Offset of field: timerDef_s::inputIrq"]
        [::std::mem::offset_of!(timerDef_s, inputIrq) - 9usize];
};
pub type timerDef_t = timerDef_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timerHardware_s {
    pub tim: *mut TIM_TypeDef,
    pub tag: ioTag_t,
    pub channel: u8,
    pub output: u8,
    pub alternateFunction: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timerHardware_s"][::std::mem::size_of::<timerHardware_s>() - 16usize];
    ["Alignment of timerHardware_s"][::std::mem::align_of::<timerHardware_s>() - 8usize];
    ["Offset of field: timerHardware_s::tim"]
        [::std::mem::offset_of!(timerHardware_s, tim) - 0usize];
    ["Offset of field: timerHardware_s::tag"]
        [::std::mem::offset_of!(timerHardware_s, tag) - 8usize];
    ["Offset of field: timerHardware_s::channel"]
        [::std::mem::offset_of!(timerHardware_s, channel) - 9usize];
    ["Offset of field: timerHardware_s::output"]
        [::std::mem::offset_of!(timerHardware_s, output) - 10usize];
    ["Offset of field: timerHardware_s::alternateFunction"]
        [::std::mem::offset_of!(timerHardware_s, alternateFunction) - 11usize];
};
pub type timerHardware_t = timerHardware_s;
pub const timerFlag_e_TIMER_OUTPUT_NONE: timerFlag_e = 0;
pub const timerFlag_e_TIMER_OUTPUT_INVERTED: timerFlag_e = 1;
pub const timerFlag_e_TIMER_OUTPUT_N_CHANNEL: timerFlag_e = 2;
pub type timerFlag_e = ::std::os::raw::c_uint;
pub const channelType_t_TYPE_FREE: channelType_t = 0;
pub const channelType_t_TYPE_PWMINPUT: channelType_t = 1;
pub const channelType_t_TYPE_PPMINPUT: channelType_t = 2;
pub const channelType_t_TYPE_PWMOUTPUT_MOTOR: channelType_t = 3;
pub const channelType_t_TYPE_PWMOUTPUT_FAST: channelType_t = 4;
pub const channelType_t_TYPE_PWMOUTPUT_SERVO: channelType_t = 5;
pub const channelType_t_TYPE_SOFTSERIAL_RX: channelType_t = 6;
pub const channelType_t_TYPE_SOFTSERIAL_TX: channelType_t = 7;
pub const channelType_t_TYPE_SOFTSERIAL_RXTX: channelType_t = 8;
pub const channelType_t_TYPE_SOFTSERIAL_AUXTIMER: channelType_t = 9;
pub const channelType_t_TYPE_ADC: channelType_t = 10;
pub const channelType_t_TYPE_SERIAL_RX: channelType_t = 11;
pub const channelType_t_TYPE_SERIAL_TX: channelType_t = 12;
pub const channelType_t_TYPE_SERIAL_RXTX: channelType_t = 13;
pub const channelType_t_TYPE_TIMER: channelType_t = 14;
pub type channelType_t = ::std::os::raw::c_uint;
pub const dshotBitbangMode_e_DSHOT_BITBANG_OFF: dshotBitbangMode_e = 0;
pub const dshotBitbangMode_e_DSHOT_BITBANG_ON: dshotBitbangMode_e = 1;
pub const dshotBitbangMode_e_DSHOT_BITBANG_AUTO: dshotBitbangMode_e = 2;
pub type dshotBitbangMode_e = ::std::os::raw::c_uint;
pub const dshotBitbangStatus_e_DSHOT_BITBANG_STATUS_OK: dshotBitbangStatus_e = 0;
pub const dshotBitbangStatus_e_DSHOT_BITBANG_STATUS_MOTOR_PIN_CONFLICT: dshotBitbangStatus_e = 1;
pub const dshotBitbangStatus_e_DSHOT_BITBANG_STATUS_NO_PACER: dshotBitbangStatus_e = 2;
pub const dshotBitbangStatus_e_DSHOT_BITBANG_STATUS_TOO_MANY_PORTS: dshotBitbangStatus_e = 3;
pub type dshotBitbangStatus_e = ::std::os::raw::c_uint;
pub const dshotBitbangedTimer_e_DSHOT_BITBANGED_TIMER_AUTO: dshotBitbangedTimer_e = 0;
pub const dshotBitbangedTimer_e_DSHOT_BITBANGED_TIMER_TIM1: dshotBitbangedTimer_e = 1;
pub const dshotBitbangedTimer_e_DSHOT_BITBANGED_TIMER_TIM8: dshotBitbangedTimer_e = 2;
pub type dshotBitbangedTimer_e = ::std::os::raw::c_uint;
pub const dshotDmar_e_DSHOT_DMAR_OFF: dshotDmar_e = 0;
pub const dshotDmar_e_DSHOT_DMAR_ON: dshotDmar_e = 1;
pub const dshotDmar_e_DSHOT_DMAR_AUTO: dshotDmar_e = 2;
pub type dshotDmar_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct motorDevConfig_s {
    pub motorPwmRate: u16,
    pub motorPwmProtocol: u8,
    pub motorPwmInversion: u8,
    pub useUnsyncedPwm: u8,
    pub useBurstDshot: u8,
    pub useDshotTelemetry: u8,
    pub useDshotEdt: u8,
    pub ioTags: [ioTag_t; 8usize],
    pub motorTransportProtocol: u8,
    pub useDshotBitbang: u8,
    pub useDshotBitbangedTimer: u8,
    pub motorOutputReordering: [u8; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of motorDevConfig_s"][::std::mem::size_of::<motorDevConfig_s>() - 28usize];
    ["Alignment of motorDevConfig_s"][::std::mem::align_of::<motorDevConfig_s>() - 2usize];
    ["Offset of field: motorDevConfig_s::motorPwmRate"]
        [::std::mem::offset_of!(motorDevConfig_s, motorPwmRate) - 0usize];
    ["Offset of field: motorDevConfig_s::motorPwmProtocol"]
        [::std::mem::offset_of!(motorDevConfig_s, motorPwmProtocol) - 2usize];
    ["Offset of field: motorDevConfig_s::motorPwmInversion"]
        [::std::mem::offset_of!(motorDevConfig_s, motorPwmInversion) - 3usize];
    ["Offset of field: motorDevConfig_s::useUnsyncedPwm"]
        [::std::mem::offset_of!(motorDevConfig_s, useUnsyncedPwm) - 4usize];
    ["Offset of field: motorDevConfig_s::useBurstDshot"]
        [::std::mem::offset_of!(motorDevConfig_s, useBurstDshot) - 5usize];
    ["Offset of field: motorDevConfig_s::useDshotTelemetry"]
        [::std::mem::offset_of!(motorDevConfig_s, useDshotTelemetry) - 6usize];
    ["Offset of field: motorDevConfig_s::useDshotEdt"]
        [::std::mem::offset_of!(motorDevConfig_s, useDshotEdt) - 7usize];
    ["Offset of field: motorDevConfig_s::ioTags"]
        [::std::mem::offset_of!(motorDevConfig_s, ioTags) - 8usize];
    ["Offset of field: motorDevConfig_s::motorTransportProtocol"]
        [::std::mem::offset_of!(motorDevConfig_s, motorTransportProtocol) - 16usize];
    ["Offset of field: motorDevConfig_s::useDshotBitbang"]
        [::std::mem::offset_of!(motorDevConfig_s, useDshotBitbang) - 17usize];
    ["Offset of field: motorDevConfig_s::useDshotBitbangedTimer"]
        [::std::mem::offset_of!(motorDevConfig_s, useDshotBitbangedTimer) - 18usize];
    ["Offset of field: motorDevConfig_s::motorOutputReordering"]
        [::std::mem::offset_of!(motorDevConfig_s, motorOutputReordering) - 19usize];
};
pub type motorDevConfig_t = motorDevConfig_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct motorConfig_s {
    pub dev: motorDevConfig_t,
    pub digitalIdleOffsetValue: u16,
    pub minthrottle: u16,
    pub maxthrottle: u16,
    pub mincommand: u16,
    pub kv: u16,
    pub motorPoleCount: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of motorConfig_s"][::std::mem::size_of::<motorConfig_s>() - 40usize];
    ["Alignment of motorConfig_s"][::std::mem::align_of::<motorConfig_s>() - 2usize];
    ["Offset of field: motorConfig_s::dev"][::std::mem::offset_of!(motorConfig_s, dev) - 0usize];
    ["Offset of field: motorConfig_s::digitalIdleOffsetValue"]
        [::std::mem::offset_of!(motorConfig_s, digitalIdleOffsetValue) - 28usize];
    ["Offset of field: motorConfig_s::minthrottle"]
        [::std::mem::offset_of!(motorConfig_s, minthrottle) - 30usize];
    ["Offset of field: motorConfig_s::maxthrottle"]
        [::std::mem::offset_of!(motorConfig_s, maxthrottle) - 32usize];
    ["Offset of field: motorConfig_s::mincommand"]
        [::std::mem::offset_of!(motorConfig_s, mincommand) - 34usize];
    ["Offset of field: motorConfig_s::kv"][::std::mem::offset_of!(motorConfig_s, kv) - 36usize];
    ["Offset of field: motorConfig_s::motorPoleCount"]
        [::std::mem::offset_of!(motorConfig_s, motorPoleCount) - 38usize];
};
pub type motorConfig_t = motorConfig_s;
pub const motorPwmProtocolTypes_e_PWM_TYPE_STANDARD: motorPwmProtocolTypes_e = 0;
pub const motorPwmProtocolTypes_e_PWM_TYPE_ONESHOT125: motorPwmProtocolTypes_e = 1;
pub const motorPwmProtocolTypes_e_PWM_TYPE_ONESHOT42: motorPwmProtocolTypes_e = 2;
pub const motorPwmProtocolTypes_e_PWM_TYPE_MULTISHOT: motorPwmProtocolTypes_e = 3;
pub const motorPwmProtocolTypes_e_PWM_TYPE_BRUSHED: motorPwmProtocolTypes_e = 4;
pub const motorPwmProtocolTypes_e_PWM_TYPE_DSHOT150: motorPwmProtocolTypes_e = 5;
pub const motorPwmProtocolTypes_e_PWM_TYPE_DSHOT300: motorPwmProtocolTypes_e = 6;
pub const motorPwmProtocolTypes_e_PWM_TYPE_DSHOT600: motorPwmProtocolTypes_e = 7;
pub const motorPwmProtocolTypes_e_PWM_TYPE_PROSHOT1000: motorPwmProtocolTypes_e = 8;
pub const motorPwmProtocolTypes_e_PWM_TYPE_DISABLED: motorPwmProtocolTypes_e = 9;
pub const motorPwmProtocolTypes_e_PWM_TYPE_MAX: motorPwmProtocolTypes_e = 10;
pub type motorPwmProtocolTypes_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct motorVTable_s {
    pub postInit: ::std::option::Option<unsafe extern "C" fn()>,
    pub convertExternalToMotor:
        ::std::option::Option<unsafe extern "C" fn(externalValue: u16) -> f32>,
    pub convertMotorToExternal: ::std::option::Option<unsafe extern "C" fn(motorValue: f32) -> u16>,
    pub enable: ::std::option::Option<unsafe extern "C" fn() -> bool>,
    pub disable: ::std::option::Option<unsafe extern "C" fn()>,
    pub isMotorEnabled: ::std::option::Option<unsafe extern "C" fn(index: u8) -> bool>,
    pub telemetryWait: ::std::option::Option<unsafe extern "C" fn() -> bool>,
    pub decodeTelemetry: ::std::option::Option<unsafe extern "C" fn() -> bool>,
    pub updateInit: ::std::option::Option<unsafe extern "C" fn()>,
    pub write: ::std::option::Option<unsafe extern "C" fn(index: u8, value: f32)>,
    pub writeInt: ::std::option::Option<unsafe extern "C" fn(index: u8, value: u16)>,
    pub updateComplete: ::std::option::Option<unsafe extern "C" fn()>,
    pub shutdown: ::std::option::Option<unsafe extern "C" fn()>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of motorVTable_s"][::std::mem::size_of::<motorVTable_s>() - 104usize];
    ["Alignment of motorVTable_s"][::std::mem::align_of::<motorVTable_s>() - 8usize];
    ["Offset of field: motorVTable_s::postInit"]
        [::std::mem::offset_of!(motorVTable_s, postInit) - 0usize];
    ["Offset of field: motorVTable_s::convertExternalToMotor"]
        [::std::mem::offset_of!(motorVTable_s, convertExternalToMotor) - 8usize];
    ["Offset of field: motorVTable_s::convertMotorToExternal"]
        [::std::mem::offset_of!(motorVTable_s, convertMotorToExternal) - 16usize];
    ["Offset of field: motorVTable_s::enable"]
        [::std::mem::offset_of!(motorVTable_s, enable) - 24usize];
    ["Offset of field: motorVTable_s::disable"]
        [::std::mem::offset_of!(motorVTable_s, disable) - 32usize];
    ["Offset of field: motorVTable_s::isMotorEnabled"]
        [::std::mem::offset_of!(motorVTable_s, isMotorEnabled) - 40usize];
    ["Offset of field: motorVTable_s::telemetryWait"]
        [::std::mem::offset_of!(motorVTable_s, telemetryWait) - 48usize];
    ["Offset of field: motorVTable_s::decodeTelemetry"]
        [::std::mem::offset_of!(motorVTable_s, decodeTelemetry) - 56usize];
    ["Offset of field: motorVTable_s::updateInit"]
        [::std::mem::offset_of!(motorVTable_s, updateInit) - 64usize];
    ["Offset of field: motorVTable_s::write"]
        [::std::mem::offset_of!(motorVTable_s, write) - 72usize];
    ["Offset of field: motorVTable_s::writeInt"]
        [::std::mem::offset_of!(motorVTable_s, writeInt) - 80usize];
    ["Offset of field: motorVTable_s::updateComplete"]
        [::std::mem::offset_of!(motorVTable_s, updateComplete) - 88usize];
    ["Offset of field: motorVTable_s::shutdown"]
        [::std::mem::offset_of!(motorVTable_s, shutdown) - 96usize];
};
pub type motorVTable_t = motorVTable_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct motorDevice_s {
    pub vTable: motorVTable_t,
    pub count: u8,
    pub initialized: bool,
    pub enabled: bool,
    pub motorEnableTimeMs: timeMs_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of motorDevice_s"][::std::mem::size_of::<motorDevice_s>() - 112usize];
    ["Alignment of motorDevice_s"][::std::mem::align_of::<motorDevice_s>() - 8usize];
    ["Offset of field: motorDevice_s::vTable"]
        [::std::mem::offset_of!(motorDevice_s, vTable) - 0usize];
    ["Offset of field: motorDevice_s::count"]
        [::std::mem::offset_of!(motorDevice_s, count) - 104usize];
    ["Offset of field: motorDevice_s::initialized"]
        [::std::mem::offset_of!(motorDevice_s, initialized) - 105usize];
    ["Offset of field: motorDevice_s::enabled"]
        [::std::mem::offset_of!(motorDevice_s, enabled) - 106usize];
    ["Offset of field: motorDevice_s::motorEnableTimeMs"]
        [::std::mem::offset_of!(motorDevice_s, motorEnableTimeMs) - 108usize];
};
pub type motorDevice_t = motorDevice_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timerChannel_t {
    pub ccr: *mut timCCR_t,
    pub tim: *mut TIM_TypeDef,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timerChannel_t"][::std::mem::size_of::<timerChannel_t>() - 16usize];
    ["Alignment of timerChannel_t"][::std::mem::align_of::<timerChannel_t>() - 8usize];
    ["Offset of field: timerChannel_t::ccr"][::std::mem::offset_of!(timerChannel_t, ccr) - 0usize];
    ["Offset of field: timerChannel_t::tim"][::std::mem::offset_of!(timerChannel_t, tim) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pwmOutputPort_t {
    pub channel: timerChannel_t,
    pub pulseScale: f32,
    pub pulseOffset: f32,
    pub forceOverflow: bool,
    pub enabled: bool,
    pub io: IO_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pwmOutputPort_t"][::std::mem::size_of::<pwmOutputPort_t>() - 40usize];
    ["Alignment of pwmOutputPort_t"][::std::mem::align_of::<pwmOutputPort_t>() - 8usize];
    ["Offset of field: pwmOutputPort_t::channel"]
        [::std::mem::offset_of!(pwmOutputPort_t, channel) - 0usize];
    ["Offset of field: pwmOutputPort_t::pulseScale"]
        [::std::mem::offset_of!(pwmOutputPort_t, pulseScale) - 16usize];
    ["Offset of field: pwmOutputPort_t::pulseOffset"]
        [::std::mem::offset_of!(pwmOutputPort_t, pulseOffset) - 20usize];
    ["Offset of field: pwmOutputPort_t::forceOverflow"]
        [::std::mem::offset_of!(pwmOutputPort_t, forceOverflow) - 24usize];
    ["Offset of field: pwmOutputPort_t::enabled"]
        [::std::mem::offset_of!(pwmOutputPort_t, enabled) - 25usize];
    ["Offset of field: pwmOutputPort_t::io"][::std::mem::offset_of!(pwmOutputPort_t, io) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct servoDevConfig_s {
    pub servoCenterPulse: u16,
    pub servoPwmRate: u16,
    pub ioTags: [ioTag_t; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of servoDevConfig_s"][::std::mem::size_of::<servoDevConfig_s>() - 12usize];
    ["Alignment of servoDevConfig_s"][::std::mem::align_of::<servoDevConfig_s>() - 2usize];
    ["Offset of field: servoDevConfig_s::servoCenterPulse"]
        [::std::mem::offset_of!(servoDevConfig_s, servoCenterPulse) - 0usize];
    ["Offset of field: servoDevConfig_s::servoPwmRate"]
        [::std::mem::offset_of!(servoDevConfig_s, servoPwmRate) - 2usize];
    ["Offset of field: servoDevConfig_s::ioTags"]
        [::std::mem::offset_of!(servoDevConfig_s, ioTags) - 4usize];
};
pub type servoDevConfig_t = servoDevConfig_s;
pub const portMode_e_MODE_RX: portMode_e = 1;
pub const portMode_e_MODE_TX: portMode_e = 2;
pub const portMode_e_MODE_RXTX: portMode_e = 3;
pub type portMode_e = ::std::os::raw::c_uint;
pub const portOptions_e_SERIAL_NOT_INVERTED: portOptions_e = 0;
pub const portOptions_e_SERIAL_INVERTED: portOptions_e = 1;
pub const portOptions_e_SERIAL_STOPBITS_1: portOptions_e = 0;
pub const portOptions_e_SERIAL_STOPBITS_2: portOptions_e = 2;
pub const portOptions_e_SERIAL_PARITY_NO: portOptions_e = 0;
pub const portOptions_e_SERIAL_PARITY_EVEN: portOptions_e = 4;
pub const portOptions_e_SERIAL_UNIDIR: portOptions_e = 0;
pub const portOptions_e_SERIAL_BIDIR: portOptions_e = 8;
pub const portOptions_e_SERIAL_BIDIR_OD: portOptions_e = 0;
pub const portOptions_e_SERIAL_BIDIR_PP: portOptions_e = 16;
pub const portOptions_e_SERIAL_BIDIR_NOPULL: portOptions_e = 32;
pub const portOptions_e_SERIAL_BIDIR_PP_PD: portOptions_e = 64;
pub const portOptions_e_SERIAL_CHECK_TX: portOptions_e = 128;
pub type portOptions_e = ::std::os::raw::c_uint;
pub type serialReceiveCallbackPtr = ::std::option::Option<
    unsafe extern "C" fn(data: u16, rxCallbackData: *mut ::std::os::raw::c_void),
>;
pub type serialIdleCallbackPtr = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct serialPort_s {
    pub vTable: *const serialPortVTable,
    pub mode: portMode_e,
    pub options: portOptions_e,
    pub baudRate: u32,
    pub rxBufferSize: u32,
    pub txBufferSize: u32,
    pub rxBuffer: *mut u8,
    pub txBuffer: *mut u8,
    pub rxBufferHead: u32,
    pub rxBufferTail: u32,
    pub txBufferHead: u32,
    pub txBufferTail: u32,
    pub rxCallback: serialReceiveCallbackPtr,
    pub rxCallbackData: *mut ::std::os::raw::c_void,
    pub idleCallback: serialIdleCallbackPtr,
    pub identifier: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of serialPort_s"][::std::mem::size_of::<serialPort_s>() - 96usize];
    ["Alignment of serialPort_s"][::std::mem::align_of::<serialPort_s>() - 8usize];
    ["Offset of field: serialPort_s::vTable"]
        [::std::mem::offset_of!(serialPort_s, vTable) - 0usize];
    ["Offset of field: serialPort_s::mode"][::std::mem::offset_of!(serialPort_s, mode) - 8usize];
    ["Offset of field: serialPort_s::options"]
        [::std::mem::offset_of!(serialPort_s, options) - 12usize];
    ["Offset of field: serialPort_s::baudRate"]
        [::std::mem::offset_of!(serialPort_s, baudRate) - 16usize];
    ["Offset of field: serialPort_s::rxBufferSize"]
        [::std::mem::offset_of!(serialPort_s, rxBufferSize) - 20usize];
    ["Offset of field: serialPort_s::txBufferSize"]
        [::std::mem::offset_of!(serialPort_s, txBufferSize) - 24usize];
    ["Offset of field: serialPort_s::rxBuffer"]
        [::std::mem::offset_of!(serialPort_s, rxBuffer) - 32usize];
    ["Offset of field: serialPort_s::txBuffer"]
        [::std::mem::offset_of!(serialPort_s, txBuffer) - 40usize];
    ["Offset of field: serialPort_s::rxBufferHead"]
        [::std::mem::offset_of!(serialPort_s, rxBufferHead) - 48usize];
    ["Offset of field: serialPort_s::rxBufferTail"]
        [::std::mem::offset_of!(serialPort_s, rxBufferTail) - 52usize];
    ["Offset of field: serialPort_s::txBufferHead"]
        [::std::mem::offset_of!(serialPort_s, txBufferHead) - 56usize];
    ["Offset of field: serialPort_s::txBufferTail"]
        [::std::mem::offset_of!(serialPort_s, txBufferTail) - 60usize];
    ["Offset of field: serialPort_s::rxCallback"]
        [::std::mem::offset_of!(serialPort_s, rxCallback) - 64usize];
    ["Offset of field: serialPort_s::rxCallbackData"]
        [::std::mem::offset_of!(serialPort_s, rxCallbackData) - 72usize];
    ["Offset of field: serialPort_s::idleCallback"]
        [::std::mem::offset_of!(serialPort_s, idleCallback) - 80usize];
    ["Offset of field: serialPort_s::identifier"]
        [::std::mem::offset_of!(serialPort_s, identifier) - 88usize];
};
pub type serialPort_t = serialPort_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct serialPinConfig_s {
    pub ioTagTx: [ioTag_t; 11usize],
    pub ioTagRx: [ioTag_t; 11usize],
    pub ioTagInverter: [ioTag_t; 11usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of serialPinConfig_s"][::std::mem::size_of::<serialPinConfig_s>() - 33usize];
    ["Alignment of serialPinConfig_s"][::std::mem::align_of::<serialPinConfig_s>() - 1usize];
    ["Offset of field: serialPinConfig_s::ioTagTx"]
        [::std::mem::offset_of!(serialPinConfig_s, ioTagTx) - 0usize];
    ["Offset of field: serialPinConfig_s::ioTagRx"]
        [::std::mem::offset_of!(serialPinConfig_s, ioTagRx) - 11usize];
    ["Offset of field: serialPinConfig_s::ioTagInverter"]
        [::std::mem::offset_of!(serialPinConfig_s, ioTagInverter) - 22usize];
};
pub type serialPinConfig_t = serialPinConfig_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct serialPortVTable {
    pub serialWrite:
        ::std::option::Option<unsafe extern "C" fn(instance: *mut serialPort_t, ch: u8)>,
    pub serialTotalRxWaiting:
        ::std::option::Option<unsafe extern "C" fn(instance: *const serialPort_t) -> u32>,
    pub serialTotalTxFree:
        ::std::option::Option<unsafe extern "C" fn(instance: *const serialPort_t) -> u32>,
    pub serialRead: ::std::option::Option<unsafe extern "C" fn(instance: *mut serialPort_t) -> u8>,
    pub serialSetBaudRate:
        ::std::option::Option<unsafe extern "C" fn(instance: *mut serialPort_t, baudRate: u32)>,
    pub isSerialTransmitBufferEmpty:
        ::std::option::Option<unsafe extern "C" fn(instance: *const serialPort_t) -> bool>,
    pub setMode:
        ::std::option::Option<unsafe extern "C" fn(instance: *mut serialPort_t, mode: portMode_e)>,
    pub setCtrlLineStateCb: ::std::option::Option<
        unsafe extern "C" fn(
            instance: *mut serialPort_t,
            cb: ::std::option::Option<
                unsafe extern "C" fn(instance: *mut ::std::os::raw::c_void, ctrlLineState: u16),
            >,
            context: *mut ::std::os::raw::c_void,
        ),
    >,
    pub setBaudRateCb: ::std::option::Option<
        unsafe extern "C" fn(
            instance: *mut serialPort_t,
            cb: ::std::option::Option<unsafe extern "C" fn(context: *mut serialPort_t, baud: u32)>,
            context: *mut serialPort_t,
        ),
    >,
    pub writeBuf: ::std::option::Option<
        unsafe extern "C" fn(
            instance: *mut serialPort_t,
            data: *const ::std::os::raw::c_void,
            count: ::std::os::raw::c_int,
        ),
    >,
    pub beginWrite: ::std::option::Option<unsafe extern "C" fn(instance: *mut serialPort_t)>,
    pub endWrite: ::std::option::Option<unsafe extern "C" fn(instance: *mut serialPort_t)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of serialPortVTable"][::std::mem::size_of::<serialPortVTable>() - 96usize];
    ["Alignment of serialPortVTable"][::std::mem::align_of::<serialPortVTable>() - 8usize];
    ["Offset of field: serialPortVTable::serialWrite"]
        [::std::mem::offset_of!(serialPortVTable, serialWrite) - 0usize];
    ["Offset of field: serialPortVTable::serialTotalRxWaiting"]
        [::std::mem::offset_of!(serialPortVTable, serialTotalRxWaiting) - 8usize];
    ["Offset of field: serialPortVTable::serialTotalTxFree"]
        [::std::mem::offset_of!(serialPortVTable, serialTotalTxFree) - 16usize];
    ["Offset of field: serialPortVTable::serialRead"]
        [::std::mem::offset_of!(serialPortVTable, serialRead) - 24usize];
    ["Offset of field: serialPortVTable::serialSetBaudRate"]
        [::std::mem::offset_of!(serialPortVTable, serialSetBaudRate) - 32usize];
    ["Offset of field: serialPortVTable::isSerialTransmitBufferEmpty"]
        [::std::mem::offset_of!(serialPortVTable, isSerialTransmitBufferEmpty) - 40usize];
    ["Offset of field: serialPortVTable::setMode"]
        [::std::mem::offset_of!(serialPortVTable, setMode) - 48usize];
    ["Offset of field: serialPortVTable::setCtrlLineStateCb"]
        [::std::mem::offset_of!(serialPortVTable, setCtrlLineStateCb) - 56usize];
    ["Offset of field: serialPortVTable::setBaudRateCb"]
        [::std::mem::offset_of!(serialPortVTable, setBaudRateCb) - 64usize];
    ["Offset of field: serialPortVTable::writeBuf"]
        [::std::mem::offset_of!(serialPortVTable, writeBuf) - 72usize];
    ["Offset of field: serialPortVTable::beginWrite"]
        [::std::mem::offset_of!(serialPortVTable, beginWrite) - 80usize];
    ["Offset of field: serialPortVTable::endWrite"]
        [::std::mem::offset_of!(serialPortVTable, endWrite) - 88usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wsPort_t {
    pub port: serialPort_t,
    pub rxBufferPre: [u8; 40usize],
    pub rxBuffer: [u8; 1400usize],
    pub txBufferPre: [u8; 40usize],
    pub txBuffer: [u8; 1400usize],
    pub context: *mut lws_context,
    pub wsi: *mut lws,
    pub connected: bool,
    pub clientCount: u16,
    pub id: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of wsPort_t"][::std::mem::size_of::<wsPort_t>() - 3000usize];
    ["Alignment of wsPort_t"][::std::mem::align_of::<wsPort_t>() - 8usize];
    ["Offset of field: wsPort_t::port"][::std::mem::offset_of!(wsPort_t, port) - 0usize];
    ["Offset of field: wsPort_t::rxBufferPre"]
        [::std::mem::offset_of!(wsPort_t, rxBufferPre) - 96usize];
    ["Offset of field: wsPort_t::rxBuffer"][::std::mem::offset_of!(wsPort_t, rxBuffer) - 136usize];
    ["Offset of field: wsPort_t::txBufferPre"]
        [::std::mem::offset_of!(wsPort_t, txBufferPre) - 1536usize];
    ["Offset of field: wsPort_t::txBuffer"][::std::mem::offset_of!(wsPort_t, txBuffer) - 1576usize];
    ["Offset of field: wsPort_t::context"][::std::mem::offset_of!(wsPort_t, context) - 2976usize];
    ["Offset of field: wsPort_t::wsi"][::std::mem::offset_of!(wsPort_t, wsi) - 2984usize];
    ["Offset of field: wsPort_t::connected"]
        [::std::mem::offset_of!(wsPort_t, connected) - 2992usize];
    ["Offset of field: wsPort_t::clientCount"]
        [::std::mem::offset_of!(wsPort_t, clientCount) - 2994usize];
    ["Offset of field: wsPort_t::id"][::std::mem::offset_of!(wsPort_t, id) - 2996usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct beeperDevConfig_s {
    _unused: [u8; 0],
}
pub const systemState_e_SYSTEM_STATE_INITIALISING: systemState_e = 0;
pub const systemState_e_SYSTEM_STATE_CONFIG_LOADED: systemState_e = 1;
pub const systemState_e_SYSTEM_STATE_SENSORS_READY: systemState_e = 2;
pub const systemState_e_SYSTEM_STATE_MOTORS_READY: systemState_e = 4;
pub const systemState_e_SYSTEM_STATE_TRANSPONDER_ENABLED: systemState_e = 8;
pub const systemState_e_SYSTEM_STATE_READY: systemState_e = 128;
pub type systemState_e = ::std::os::raw::c_uint;
pub const armingFlag_e_ARMED: armingFlag_e = 1;
pub const armingFlag_e_WAS_EVER_ARMED: armingFlag_e = 2;
pub const armingFlag_e_WAS_ARMED_WITH_PREARM: armingFlag_e = 4;
pub type armingFlag_e = ::std::os::raw::c_uint;
pub const armingDisableFlags_e_ARMING_DISABLED_NO_GYRO: armingDisableFlags_e = 1;
pub const armingDisableFlags_e_ARMING_DISABLED_FAILSAFE: armingDisableFlags_e = 2;
pub const armingDisableFlags_e_ARMING_DISABLED_RX_FAILSAFE: armingDisableFlags_e = 4;
pub const armingDisableFlags_e_ARMING_DISABLED_NOT_DISARMED: armingDisableFlags_e = 8;
pub const armingDisableFlags_e_ARMING_DISABLED_BOXFAILSAFE: armingDisableFlags_e = 16;
pub const armingDisableFlags_e_ARMING_DISABLED_RUNAWAY_TAKEOFF: armingDisableFlags_e = 32;
pub const armingDisableFlags_e_ARMING_DISABLED_CRASH_DETECTED: armingDisableFlags_e = 64;
pub const armingDisableFlags_e_ARMING_DISABLED_THROTTLE: armingDisableFlags_e = 128;
pub const armingDisableFlags_e_ARMING_DISABLED_ANGLE: armingDisableFlags_e = 256;
pub const armingDisableFlags_e_ARMING_DISABLED_BOOT_GRACE_TIME: armingDisableFlags_e = 512;
pub const armingDisableFlags_e_ARMING_DISABLED_NOPREARM: armingDisableFlags_e = 1024;
pub const armingDisableFlags_e_ARMING_DISABLED_LOAD: armingDisableFlags_e = 2048;
pub const armingDisableFlags_e_ARMING_DISABLED_CALIBRATING: armingDisableFlags_e = 4096;
pub const armingDisableFlags_e_ARMING_DISABLED_CLI: armingDisableFlags_e = 8192;
pub const armingDisableFlags_e_ARMING_DISABLED_CMS_MENU: armingDisableFlags_e = 16384;
pub const armingDisableFlags_e_ARMING_DISABLED_BST: armingDisableFlags_e = 32768;
pub const armingDisableFlags_e_ARMING_DISABLED_MSP: armingDisableFlags_e = 65536;
pub const armingDisableFlags_e_ARMING_DISABLED_PARALYZE: armingDisableFlags_e = 131072;
pub const armingDisableFlags_e_ARMING_DISABLED_GPS: armingDisableFlags_e = 262144;
pub const armingDisableFlags_e_ARMING_DISABLED_RESC: armingDisableFlags_e = 524288;
pub const armingDisableFlags_e_ARMING_DISABLED_RPMFILTER: armingDisableFlags_e = 1048576;
pub const armingDisableFlags_e_ARMING_DISABLED_REBOOT_REQUIRED: armingDisableFlags_e = 2097152;
pub const armingDisableFlags_e_ARMING_DISABLED_DSHOT_BITBANG: armingDisableFlags_e = 4194304;
pub const armingDisableFlags_e_ARMING_DISABLED_ACC_CALIBRATION: armingDisableFlags_e = 8388608;
pub const armingDisableFlags_e_ARMING_DISABLED_MOTOR_PROTOCOL: armingDisableFlags_e = 16777216;
pub const armingDisableFlags_e_ARMING_DISABLED_ARM_SWITCH: armingDisableFlags_e = 33554432;
pub type armingDisableFlags_e = ::std::os::raw::c_uint;
pub const flightModeFlags_e_ANGLE_MODE: flightModeFlags_e = 1;
pub const flightModeFlags_e_HORIZON_MODE: flightModeFlags_e = 2;
pub const flightModeFlags_e_MAG_MODE: flightModeFlags_e = 4;
pub const flightModeFlags_e_HEADFREE_MODE: flightModeFlags_e = 64;
pub const flightModeFlags_e_PASSTHRU_MODE: flightModeFlags_e = 256;
pub const flightModeFlags_e_FAILSAFE_MODE: flightModeFlags_e = 1024;
pub const flightModeFlags_e_GPS_RESCUE_MODE: flightModeFlags_e = 2048;
pub type flightModeFlags_e = ::std::os::raw::c_uint;
pub const stateFlags_t_GPS_FIX_HOME: stateFlags_t = 1;
pub const stateFlags_t_GPS_FIX: stateFlags_t = 2;
pub const stateFlags_t_GPS_FIX_EVER: stateFlags_t = 4;
pub type stateFlags_t = ::std::os::raw::c_uint;
pub const configurationState_e_CONFIGURATION_STATE_DEFAULTS_BARE: configurationState_e = 0;
pub const configurationState_e_CONFIGURATION_STATE_DEFAULTS_CUSTOM: configurationState_e = 1;
pub const configurationState_e_CONFIGURATION_STATE_CONFIGURED: configurationState_e = 2;
pub type configurationState_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pilotConfig_s {
    pub craftName: [::std::os::raw::c_char; 17usize],
    pub pilotName: [::std::os::raw::c_char; 17usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pilotConfig_s"][::std::mem::size_of::<pilotConfig_s>() - 34usize];
    ["Alignment of pilotConfig_s"][::std::mem::align_of::<pilotConfig_s>() - 1usize];
    ["Offset of field: pilotConfig_s::craftName"]
        [::std::mem::offset_of!(pilotConfig_s, craftName) - 0usize];
    ["Offset of field: pilotConfig_s::pilotName"]
        [::std::mem::offset_of!(pilotConfig_s, pilotName) - 17usize];
};
pub type pilotConfig_t = pilotConfig_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct systemConfig_s {
    pub pidProfileIndex: u8,
    pub activeRateProfile: u8,
    pub debug_mode: u8,
    pub task_statistics: u8,
    pub rateProfile6PosSwitch: u8,
    pub cpu_overclock: u8,
    pub powerOnArmingGraceTime: u8,
    pub boardIdentifier: [::std::os::raw::c_char; 6usize],
    pub hseMhz: u8,
    pub configurationState: u8,
    pub enableStickArming: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of systemConfig_s"][::std::mem::size_of::<systemConfig_s>() - 16usize];
    ["Alignment of systemConfig_s"][::std::mem::align_of::<systemConfig_s>() - 1usize];
    ["Offset of field: systemConfig_s::pidProfileIndex"]
        [::std::mem::offset_of!(systemConfig_s, pidProfileIndex) - 0usize];
    ["Offset of field: systemConfig_s::activeRateProfile"]
        [::std::mem::offset_of!(systemConfig_s, activeRateProfile) - 1usize];
    ["Offset of field: systemConfig_s::debug_mode"]
        [::std::mem::offset_of!(systemConfig_s, debug_mode) - 2usize];
    ["Offset of field: systemConfig_s::task_statistics"]
        [::std::mem::offset_of!(systemConfig_s, task_statistics) - 3usize];
    ["Offset of field: systemConfig_s::rateProfile6PosSwitch"]
        [::std::mem::offset_of!(systemConfig_s, rateProfile6PosSwitch) - 4usize];
    ["Offset of field: systemConfig_s::cpu_overclock"]
        [::std::mem::offset_of!(systemConfig_s, cpu_overclock) - 5usize];
    ["Offset of field: systemConfig_s::powerOnArmingGraceTime"]
        [::std::mem::offset_of!(systemConfig_s, powerOnArmingGraceTime) - 6usize];
    ["Offset of field: systemConfig_s::boardIdentifier"]
        [::std::mem::offset_of!(systemConfig_s, boardIdentifier) - 7usize];
    ["Offset of field: systemConfig_s::hseMhz"]
        [::std::mem::offset_of!(systemConfig_s, hseMhz) - 13usize];
    ["Offset of field: systemConfig_s::configurationState"]
        [::std::mem::offset_of!(systemConfig_s, configurationState) - 14usize];
    ["Offset of field: systemConfig_s::enableStickArming"]
        [::std::mem::offset_of!(systemConfig_s, enableStickArming) - 15usize];
};
pub type systemConfig_t = systemConfig_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pidProfile_s {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct schedulerConfig_s {
    pub rxRelaxDeterminism: u16,
    pub osdRelaxDeterminism: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of schedulerConfig_s"][::std::mem::size_of::<schedulerConfig_s>() - 4usize];
    ["Alignment of schedulerConfig_s"][::std::mem::align_of::<schedulerConfig_s>() - 2usize];
    ["Offset of field: schedulerConfig_s::rxRelaxDeterminism"]
        [::std::mem::offset_of!(schedulerConfig_s, rxRelaxDeterminism) - 0usize];
    ["Offset of field: schedulerConfig_s::osdRelaxDeterminism"]
        [::std::mem::offset_of!(schedulerConfig_s, osdRelaxDeterminism) - 2usize];
};
pub type schedulerConfig_t = schedulerConfig_s;
pub const taskPriority_e_TASK_PRIORITY_REALTIME: taskPriority_e = -1;
pub const taskPriority_e_TASK_PRIORITY_LOWEST: taskPriority_e = 1;
pub const taskPriority_e_TASK_PRIORITY_LOW: taskPriority_e = 2;
pub const taskPriority_e_TASK_PRIORITY_MEDIUM: taskPriority_e = 3;
pub const taskPriority_e_TASK_PRIORITY_MEDIUM_HIGH: taskPriority_e = 4;
pub const taskPriority_e_TASK_PRIORITY_HIGH: taskPriority_e = 5;
pub const taskPriority_e_TASK_PRIORITY_MAX: taskPriority_e = 255;
pub type taskPriority_e = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cfCheckFuncInfo_t {
    pub maxExecutionTimeUs: timeUs_t,
    pub totalExecutionTimeUs: timeUs_t,
    pub averageExecutionTimeUs: timeUs_t,
    pub averageDeltaTimeUs: timeUs_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cfCheckFuncInfo_t"][::std::mem::size_of::<cfCheckFuncInfo_t>() - 16usize];
    ["Alignment of cfCheckFuncInfo_t"][::std::mem::align_of::<cfCheckFuncInfo_t>() - 4usize];
    ["Offset of field: cfCheckFuncInfo_t::maxExecutionTimeUs"]
        [::std::mem::offset_of!(cfCheckFuncInfo_t, maxExecutionTimeUs) - 0usize];
    ["Offset of field: cfCheckFuncInfo_t::totalExecutionTimeUs"]
        [::std::mem::offset_of!(cfCheckFuncInfo_t, totalExecutionTimeUs) - 4usize];
    ["Offset of field: cfCheckFuncInfo_t::averageExecutionTimeUs"]
        [::std::mem::offset_of!(cfCheckFuncInfo_t, averageExecutionTimeUs) - 8usize];
    ["Offset of field: cfCheckFuncInfo_t::averageDeltaTimeUs"]
        [::std::mem::offset_of!(cfCheckFuncInfo_t, averageDeltaTimeUs) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct taskInfo_t {
    pub taskName: *const ::std::os::raw::c_char,
    pub subTaskName: *const ::std::os::raw::c_char,
    pub isEnabled: bool,
    pub staticPriority: i8,
    pub desiredPeriodUs: timeDelta_t,
    pub latestDeltaTimeUs: timeDelta_t,
    pub maxExecutionTimeUs: timeUs_t,
    pub totalExecutionTimeUs: timeUs_t,
    pub averageExecutionTime10thUs: timeUs_t,
    pub averageDeltaTime10thUs: timeUs_t,
    pub movingAverageCycleTimeUs: f32,
    pub runCount: u32,
    pub lateCount: u32,
    pub execTime: timeUs_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of taskInfo_t"][::std::mem::size_of::<taskInfo_t>() - 64usize];
    ["Alignment of taskInfo_t"][::std::mem::align_of::<taskInfo_t>() - 8usize];
    ["Offset of field: taskInfo_t::taskName"]
        [::std::mem::offset_of!(taskInfo_t, taskName) - 0usize];
    ["Offset of field: taskInfo_t::subTaskName"]
        [::std::mem::offset_of!(taskInfo_t, subTaskName) - 8usize];
    ["Offset of field: taskInfo_t::isEnabled"]
        [::std::mem::offset_of!(taskInfo_t, isEnabled) - 16usize];
    ["Offset of field: taskInfo_t::staticPriority"]
        [::std::mem::offset_of!(taskInfo_t, staticPriority) - 17usize];
    ["Offset of field: taskInfo_t::desiredPeriodUs"]
        [::std::mem::offset_of!(taskInfo_t, desiredPeriodUs) - 20usize];
    ["Offset of field: taskInfo_t::latestDeltaTimeUs"]
        [::std::mem::offset_of!(taskInfo_t, latestDeltaTimeUs) - 24usize];
    ["Offset of field: taskInfo_t::maxExecutionTimeUs"]
        [::std::mem::offset_of!(taskInfo_t, maxExecutionTimeUs) - 28usize];
    ["Offset of field: taskInfo_t::totalExecutionTimeUs"]
        [::std::mem::offset_of!(taskInfo_t, totalExecutionTimeUs) - 32usize];
    ["Offset of field: taskInfo_t::averageExecutionTime10thUs"]
        [::std::mem::offset_of!(taskInfo_t, averageExecutionTime10thUs) - 36usize];
    ["Offset of field: taskInfo_t::averageDeltaTime10thUs"]
        [::std::mem::offset_of!(taskInfo_t, averageDeltaTime10thUs) - 40usize];
    ["Offset of field: taskInfo_t::movingAverageCycleTimeUs"]
        [::std::mem::offset_of!(taskInfo_t, movingAverageCycleTimeUs) - 44usize];
    ["Offset of field: taskInfo_t::runCount"]
        [::std::mem::offset_of!(taskInfo_t, runCount) - 48usize];
    ["Offset of field: taskInfo_t::lateCount"]
        [::std::mem::offset_of!(taskInfo_t, lateCount) - 52usize];
    ["Offset of field: taskInfo_t::execTime"]
        [::std::mem::offset_of!(taskInfo_t, execTime) - 56usize];
};
pub const taskId_e_TASK_SYSTEM: taskId_e = 0;
pub const taskId_e_TASK_MAIN: taskId_e = 1;
pub const taskId_e_TASK_GYRO: taskId_e = 2;
pub const taskId_e_TASK_FILTER: taskId_e = 3;
pub const taskId_e_TASK_PID: taskId_e = 4;
pub const taskId_e_TASK_ACCEL: taskId_e = 5;
pub const taskId_e_TASK_ATTITUDE: taskId_e = 6;
pub const taskId_e_TASK_RX: taskId_e = 7;
pub const taskId_e_TASK_SERIAL: taskId_e = 8;
pub const taskId_e_TASK_DISPATCH: taskId_e = 9;
pub const taskId_e_TASK_BATTERY_VOLTAGE: taskId_e = 10;
pub const taskId_e_TASK_BATTERY_CURRENT: taskId_e = 11;
pub const taskId_e_TASK_BATTERY_ALERTS: taskId_e = 12;
pub const taskId_e_TASK_BEEPER: taskId_e = 13;
pub const taskId_e_TASK_GPS: taskId_e = 14;
pub const taskId_e_TASK_GPS_RESCUE: taskId_e = 15;
pub const taskId_e_TASK_COMPASS: taskId_e = 16;
pub const taskId_e_TASK_BARO: taskId_e = 17;
pub const taskId_e_TASK_ALTITUDE: taskId_e = 18;
pub const taskId_e_TASK_OSD: taskId_e = 19;
pub const taskId_e_TASK_CMS: taskId_e = 20;
pub const taskId_e_TASK_RCDEVICE: taskId_e = 21;
pub const taskId_e_TASK_COUNT: taskId_e = 22;
pub const taskId_e_TASK_NONE: taskId_e = 22;
pub const taskId_e_TASK_SELF: taskId_e = 23;
pub type taskId_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct task_attribute_t {
    pub taskName: *const ::std::os::raw::c_char,
    pub subTaskName: *const ::std::os::raw::c_char,
    pub checkFunc: ::std::option::Option<
        unsafe extern "C" fn(currentTimeUs: timeUs_t, currentDeltaTimeUs: timeDelta_t) -> bool,
    >,
    pub taskFunc: ::std::option::Option<unsafe extern "C" fn(currentTimeUs: timeUs_t)>,
    pub desiredPeriodUs: timeDelta_t,
    pub staticPriority: i8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_attribute_t"][::std::mem::size_of::<task_attribute_t>() - 40usize];
    ["Alignment of task_attribute_t"][::std::mem::align_of::<task_attribute_t>() - 8usize];
    ["Offset of field: task_attribute_t::taskName"]
        [::std::mem::offset_of!(task_attribute_t, taskName) - 0usize];
    ["Offset of field: task_attribute_t::subTaskName"]
        [::std::mem::offset_of!(task_attribute_t, subTaskName) - 8usize];
    ["Offset of field: task_attribute_t::checkFunc"]
        [::std::mem::offset_of!(task_attribute_t, checkFunc) - 16usize];
    ["Offset of field: task_attribute_t::taskFunc"]
        [::std::mem::offset_of!(task_attribute_t, taskFunc) - 24usize];
    ["Offset of field: task_attribute_t::desiredPeriodUs"]
        [::std::mem::offset_of!(task_attribute_t, desiredPeriodUs) - 32usize];
    ["Offset of field: task_attribute_t::staticPriority"]
        [::std::mem::offset_of!(task_attribute_t, staticPriority) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct task_t {
    pub attribute: *mut task_attribute_t,
    pub dynamicPriority: u16,
    pub taskAgePeriods: u16,
    pub taskLatestDeltaTimeUs: timeDelta_t,
    pub lastExecutedAtUs: timeUs_t,
    pub lastSignaledAtUs: timeUs_t,
    pub lastDesiredAt: timeUs_t,
    pub movingAverageCycleTimeUs: f32,
    pub anticipatedExecutionTime: timeUs_t,
    pub movingSumDeltaTime10thUs: timeUs_t,
    pub movingSumExecutionTime10thUs: timeUs_t,
    pub maxExecutionTimeUs: timeUs_t,
    pub totalExecutionTimeUs: timeUs_t,
    pub lastStatsAtUs: timeUs_t,
    pub runCount: u32,
    pub lateCount: u32,
    pub execTime: timeUs_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of task_t"][::std::mem::size_of::<task_t>() - 72usize];
    ["Alignment of task_t"][::std::mem::align_of::<task_t>() - 8usize];
    ["Offset of field: task_t::attribute"][::std::mem::offset_of!(task_t, attribute) - 0usize];
    ["Offset of field: task_t::dynamicPriority"]
        [::std::mem::offset_of!(task_t, dynamicPriority) - 8usize];
    ["Offset of field: task_t::taskAgePeriods"]
        [::std::mem::offset_of!(task_t, taskAgePeriods) - 10usize];
    ["Offset of field: task_t::taskLatestDeltaTimeUs"]
        [::std::mem::offset_of!(task_t, taskLatestDeltaTimeUs) - 12usize];
    ["Offset of field: task_t::lastExecutedAtUs"]
        [::std::mem::offset_of!(task_t, lastExecutedAtUs) - 16usize];
    ["Offset of field: task_t::lastSignaledAtUs"]
        [::std::mem::offset_of!(task_t, lastSignaledAtUs) - 20usize];
    ["Offset of field: task_t::lastDesiredAt"]
        [::std::mem::offset_of!(task_t, lastDesiredAt) - 24usize];
    ["Offset of field: task_t::movingAverageCycleTimeUs"]
        [::std::mem::offset_of!(task_t, movingAverageCycleTimeUs) - 28usize];
    ["Offset of field: task_t::anticipatedExecutionTime"]
        [::std::mem::offset_of!(task_t, anticipatedExecutionTime) - 32usize];
    ["Offset of field: task_t::movingSumDeltaTime10thUs"]
        [::std::mem::offset_of!(task_t, movingSumDeltaTime10thUs) - 36usize];
    ["Offset of field: task_t::movingSumExecutionTime10thUs"]
        [::std::mem::offset_of!(task_t, movingSumExecutionTime10thUs) - 40usize];
    ["Offset of field: task_t::maxExecutionTimeUs"]
        [::std::mem::offset_of!(task_t, maxExecutionTimeUs) - 44usize];
    ["Offset of field: task_t::totalExecutionTimeUs"]
        [::std::mem::offset_of!(task_t, totalExecutionTimeUs) - 48usize];
    ["Offset of field: task_t::lastStatsAtUs"]
        [::std::mem::offset_of!(task_t, lastStatsAtUs) - 52usize];
    ["Offset of field: task_t::runCount"][::std::mem::offset_of!(task_t, runCount) - 56usize];
    ["Offset of field: task_t::lateCount"][::std::mem::offset_of!(task_t, lateCount) - 60usize];
    ["Offset of field: task_t::execTime"][::std::mem::offset_of!(task_t, execTime) - 64usize];
};
pub const axis_e_X: axis_e = 0;
pub const axis_e_Y: axis_e = 1;
pub const axis_e_Z: axis_e = 2;
pub type axis_e = ::std::os::raw::c_uint;
pub const flight_dynamics_index_t_FD_ROLL: flight_dynamics_index_t = 0;
pub const flight_dynamics_index_t_FD_PITCH: flight_dynamics_index_t = 1;
pub const flight_dynamics_index_t_FD_YAW: flight_dynamics_index_t = 2;
pub type flight_dynamics_index_t = ::std::os::raw::c_uint;
pub const angle_index_t_AI_ROLL: angle_index_t = 0;
pub const angle_index_t_AI_PITCH: angle_index_t = 1;
pub type angle_index_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct quaternion {
    pub w: f32,
    pub x: f32,
    pub y: f32,
    pub z: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of quaternion"][::std::mem::size_of::<quaternion>() - 16usize];
    ["Alignment of quaternion"][::std::mem::align_of::<quaternion>() - 4usize];
    ["Offset of field: quaternion::w"][::std::mem::offset_of!(quaternion, w) - 0usize];
    ["Offset of field: quaternion::x"][::std::mem::offset_of!(quaternion, x) - 4usize];
    ["Offset of field: quaternion::y"][::std::mem::offset_of!(quaternion, y) - 8usize];
    ["Offset of field: quaternion::z"][::std::mem::offset_of!(quaternion, z) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct quaternionProducts {
    pub ww: f32,
    pub wx: f32,
    pub wy: f32,
    pub wz: f32,
    pub xx: f32,
    pub xy: f32,
    pub xz: f32,
    pub yy: f32,
    pub yz: f32,
    pub zz: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of quaternionProducts"][::std::mem::size_of::<quaternionProducts>() - 40usize];
    ["Alignment of quaternionProducts"][::std::mem::align_of::<quaternionProducts>() - 4usize];
    ["Offset of field: quaternionProducts::ww"]
        [::std::mem::offset_of!(quaternionProducts, ww) - 0usize];
    ["Offset of field: quaternionProducts::wx"]
        [::std::mem::offset_of!(quaternionProducts, wx) - 4usize];
    ["Offset of field: quaternionProducts::wy"]
        [::std::mem::offset_of!(quaternionProducts, wy) - 8usize];
    ["Offset of field: quaternionProducts::wz"]
        [::std::mem::offset_of!(quaternionProducts, wz) - 12usize];
    ["Offset of field: quaternionProducts::xx"]
        [::std::mem::offset_of!(quaternionProducts, xx) - 16usize];
    ["Offset of field: quaternionProducts::xy"]
        [::std::mem::offset_of!(quaternionProducts, xy) - 20usize];
    ["Offset of field: quaternionProducts::xz"]
        [::std::mem::offset_of!(quaternionProducts, xz) - 24usize];
    ["Offset of field: quaternionProducts::yy"]
        [::std::mem::offset_of!(quaternionProducts, yy) - 28usize];
    ["Offset of field: quaternionProducts::yz"]
        [::std::mem::offset_of!(quaternionProducts, yz) - 32usize];
    ["Offset of field: quaternionProducts::zz"]
        [::std::mem::offset_of!(quaternionProducts, zz) - 36usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union attitudeEulerAngles_t {
    pub raw: [i16; 3usize],
    pub values: attitudeEulerAngles_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct attitudeEulerAngles_t__bindgen_ty_1 {
    pub roll: i16,
    pub pitch: i16,
    pub yaw: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of attitudeEulerAngles_t__bindgen_ty_1"]
        [::std::mem::size_of::<attitudeEulerAngles_t__bindgen_ty_1>() - 6usize];
    ["Alignment of attitudeEulerAngles_t__bindgen_ty_1"]
        [::std::mem::align_of::<attitudeEulerAngles_t__bindgen_ty_1>() - 2usize];
    ["Offset of field: attitudeEulerAngles_t__bindgen_ty_1::roll"]
        [::std::mem::offset_of!(attitudeEulerAngles_t__bindgen_ty_1, roll) - 0usize];
    ["Offset of field: attitudeEulerAngles_t__bindgen_ty_1::pitch"]
        [::std::mem::offset_of!(attitudeEulerAngles_t__bindgen_ty_1, pitch) - 2usize];
    ["Offset of field: attitudeEulerAngles_t__bindgen_ty_1::yaw"]
        [::std::mem::offset_of!(attitudeEulerAngles_t__bindgen_ty_1, yaw) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of attitudeEulerAngles_t"][::std::mem::size_of::<attitudeEulerAngles_t>() - 6usize];
    ["Alignment of attitudeEulerAngles_t"]
        [::std::mem::align_of::<attitudeEulerAngles_t>() - 2usize];
    ["Offset of field: attitudeEulerAngles_t::raw"]
        [::std::mem::offset_of!(attitudeEulerAngles_t, raw) - 0usize];
    ["Offset of field: attitudeEulerAngles_t::values"]
        [::std::mem::offset_of!(attitudeEulerAngles_t, values) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imuConfig_s {
    pub imu_dcm_kp: u16,
    pub imu_dcm_ki: u16,
    pub small_angle: u8,
    pub imu_process_denom: u8,
    pub mag_declination: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imuConfig_s"][::std::mem::size_of::<imuConfig_s>() - 8usize];
    ["Alignment of imuConfig_s"][::std::mem::align_of::<imuConfig_s>() - 2usize];
    ["Offset of field: imuConfig_s::imu_dcm_kp"]
        [::std::mem::offset_of!(imuConfig_s, imu_dcm_kp) - 0usize];
    ["Offset of field: imuConfig_s::imu_dcm_ki"]
        [::std::mem::offset_of!(imuConfig_s, imu_dcm_ki) - 2usize];
    ["Offset of field: imuConfig_s::small_angle"]
        [::std::mem::offset_of!(imuConfig_s, small_angle) - 4usize];
    ["Offset of field: imuConfig_s::imu_process_denom"]
        [::std::mem::offset_of!(imuConfig_s, imu_process_denom) - 5usize];
    ["Offset of field: imuConfig_s::mag_declination"]
        [::std::mem::offset_of!(imuConfig_s, mag_declination) - 6usize];
};
pub type imuConfig_t = imuConfig_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imuRuntimeConfig_s {
    pub imuDcmKi: f32,
    pub imuDcmKp: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imuRuntimeConfig_s"][::std::mem::size_of::<imuRuntimeConfig_s>() - 8usize];
    ["Alignment of imuRuntimeConfig_s"][::std::mem::align_of::<imuRuntimeConfig_s>() - 4usize];
    ["Offset of field: imuRuntimeConfig_s::imuDcmKi"]
        [::std::mem::offset_of!(imuRuntimeConfig_s, imuDcmKi) - 0usize];
    ["Offset of field: imuRuntimeConfig_s::imuDcmKp"]
        [::std::mem::offset_of!(imuRuntimeConfig_s, imuDcmKp) - 4usize];
};
pub type imuRuntimeConfig_t = imuRuntimeConfig_s;
pub const portSharing_e_PORTSHARING_UNUSED: portSharing_e = 0;
pub const portSharing_e_PORTSHARING_NOT_SHARED: portSharing_e = 1;
pub const portSharing_e_PORTSHARING_SHARED: portSharing_e = 2;
pub type portSharing_e = ::std::os::raw::c_uint;
pub const serialPortFunction_e_FUNCTION_NONE: serialPortFunction_e = 0;
pub const serialPortFunction_e_FUNCTION_MSP: serialPortFunction_e = 1;
pub const serialPortFunction_e_FUNCTION_GPS: serialPortFunction_e = 2;
pub const serialPortFunction_e_FUNCTION_TELEMETRY_FRSKY_HUB: serialPortFunction_e = 4;
pub const serialPortFunction_e_FUNCTION_TELEMETRY_HOTT: serialPortFunction_e = 8;
pub const serialPortFunction_e_FUNCTION_TELEMETRY_LTM: serialPortFunction_e = 16;
pub const serialPortFunction_e_FUNCTION_TELEMETRY_SMARTPORT: serialPortFunction_e = 32;
pub const serialPortFunction_e_FUNCTION_RX_SERIAL: serialPortFunction_e = 64;
pub const serialPortFunction_e_FUNCTION_BLACKBOX: serialPortFunction_e = 128;
pub const serialPortFunction_e_FUNCTION_TELEMETRY_MAVLINK: serialPortFunction_e = 512;
pub const serialPortFunction_e_FUNCTION_ESC_SENSOR: serialPortFunction_e = 1024;
pub const serialPortFunction_e_FUNCTION_VTX_SMARTAUDIO: serialPortFunction_e = 2048;
pub const serialPortFunction_e_FUNCTION_TELEMETRY_IBUS: serialPortFunction_e = 4096;
pub const serialPortFunction_e_FUNCTION_VTX_TRAMP: serialPortFunction_e = 8192;
pub const serialPortFunction_e_FUNCTION_RCDEVICE: serialPortFunction_e = 16384;
pub const serialPortFunction_e_FUNCTION_LIDAR_TF: serialPortFunction_e = 32768;
pub const serialPortFunction_e_FUNCTION_FRSKY_OSD: serialPortFunction_e = 65536;
pub const serialPortFunction_e_FUNCTION_VTX_MSP: serialPortFunction_e = 131072;
pub type serialPortFunction_e = ::std::os::raw::c_uint;
pub const baudRate_e_BAUD_AUTO: baudRate_e = 0;
pub const baudRate_e_BAUD_9600: baudRate_e = 1;
pub const baudRate_e_BAUD_19200: baudRate_e = 2;
pub const baudRate_e_BAUD_38400: baudRate_e = 3;
pub const baudRate_e_BAUD_57600: baudRate_e = 4;
pub const baudRate_e_BAUD_115200: baudRate_e = 5;
pub const baudRate_e_BAUD_230400: baudRate_e = 6;
pub const baudRate_e_BAUD_250000: baudRate_e = 7;
pub const baudRate_e_BAUD_400000: baudRate_e = 8;
pub const baudRate_e_BAUD_460800: baudRate_e = 9;
pub const baudRate_e_BAUD_500000: baudRate_e = 10;
pub const baudRate_e_BAUD_921600: baudRate_e = 11;
pub const baudRate_e_BAUD_1000000: baudRate_e = 12;
pub const baudRate_e_BAUD_1500000: baudRate_e = 13;
pub const baudRate_e_BAUD_2000000: baudRate_e = 14;
pub const baudRate_e_BAUD_2470000: baudRate_e = 15;
pub const baudRate_e_BAUD_COUNT: baudRate_e = 16;
pub type baudRate_e = ::std::os::raw::c_uint;
pub const serialPortIdentifier_e_SERIAL_PORT_ALL: serialPortIdentifier_e = -2;
pub const serialPortIdentifier_e_SERIAL_PORT_NONE: serialPortIdentifier_e = -1;
pub const serialPortIdentifier_e_SERIAL_PORT_USART1: serialPortIdentifier_e = 0;
pub const serialPortIdentifier_e_SERIAL_PORT_USART2: serialPortIdentifier_e = 1;
pub const serialPortIdentifier_e_SERIAL_PORT_USART3: serialPortIdentifier_e = 2;
pub const serialPortIdentifier_e_SERIAL_PORT_UART4: serialPortIdentifier_e = 3;
pub const serialPortIdentifier_e_SERIAL_PORT_UART5: serialPortIdentifier_e = 4;
pub const serialPortIdentifier_e_SERIAL_PORT_USART6: serialPortIdentifier_e = 5;
pub const serialPortIdentifier_e_SERIAL_PORT_USART7: serialPortIdentifier_e = 6;
pub const serialPortIdentifier_e_SERIAL_PORT_USART8: serialPortIdentifier_e = 7;
pub const serialPortIdentifier_e_SERIAL_PORT_UART9: serialPortIdentifier_e = 8;
pub const serialPortIdentifier_e_SERIAL_PORT_USART10: serialPortIdentifier_e = 9;
pub const serialPortIdentifier_e_SERIAL_PORT_USART_MAX: serialPortIdentifier_e = 9;
pub const serialPortIdentifier_e_SERIAL_PORT_USB_VCP: serialPortIdentifier_e = 20;
pub const serialPortIdentifier_e_SERIAL_PORT_SOFTSERIAL1: serialPortIdentifier_e = 30;
pub const serialPortIdentifier_e_SERIAL_PORT_SOFTSERIAL2: serialPortIdentifier_e = 31;
pub const serialPortIdentifier_e_SERIAL_PORT_LPUART1: serialPortIdentifier_e = 40;
pub const serialPortIdentifier_e_SERIAL_PORT_IDENTIFIER_MAX: serialPortIdentifier_e = 40;
pub type serialPortIdentifier_e = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct serialPortUsage_s {
    pub serialPort: *mut serialPort_t,
    pub function: serialPortFunction_e,
    pub identifier: serialPortIdentifier_e,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of serialPortUsage_s"][::std::mem::size_of::<serialPortUsage_s>() - 16usize];
    ["Alignment of serialPortUsage_s"][::std::mem::align_of::<serialPortUsage_s>() - 8usize];
    ["Offset of field: serialPortUsage_s::serialPort"]
        [::std::mem::offset_of!(serialPortUsage_s, serialPort) - 0usize];
    ["Offset of field: serialPortUsage_s::function"]
        [::std::mem::offset_of!(serialPortUsage_s, function) - 8usize];
    ["Offset of field: serialPortUsage_s::identifier"]
        [::std::mem::offset_of!(serialPortUsage_s, identifier) - 12usize];
};
pub type serialPortUsage_t = serialPortUsage_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct serialPortConfig_s {
    pub functionMask: u32,
    pub identifier: i8,
    pub msp_baudrateIndex: u8,
    pub gps_baudrateIndex: u8,
    pub blackbox_baudrateIndex: u8,
    pub telemetry_baudrateIndex: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of serialPortConfig_s"][::std::mem::size_of::<serialPortConfig_s>() - 12usize];
    ["Alignment of serialPortConfig_s"][::std::mem::align_of::<serialPortConfig_s>() - 4usize];
    ["Offset of field: serialPortConfig_s::functionMask"]
        [::std::mem::offset_of!(serialPortConfig_s, functionMask) - 0usize];
    ["Offset of field: serialPortConfig_s::identifier"]
        [::std::mem::offset_of!(serialPortConfig_s, identifier) - 4usize];
    ["Offset of field: serialPortConfig_s::msp_baudrateIndex"]
        [::std::mem::offset_of!(serialPortConfig_s, msp_baudrateIndex) - 5usize];
    ["Offset of field: serialPortConfig_s::gps_baudrateIndex"]
        [::std::mem::offset_of!(serialPortConfig_s, gps_baudrateIndex) - 6usize];
    ["Offset of field: serialPortConfig_s::blackbox_baudrateIndex"]
        [::std::mem::offset_of!(serialPortConfig_s, blackbox_baudrateIndex) - 7usize];
    ["Offset of field: serialPortConfig_s::telemetry_baudrateIndex"]
        [::std::mem::offset_of!(serialPortConfig_s, telemetry_baudrateIndex) - 8usize];
};
pub type serialPortConfig_t = serialPortConfig_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct serialConfig_s {
    pub portConfigs: [serialPortConfig_t; 8usize],
    pub serial_update_rate_hz: u16,
    pub reboot_character: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of serialConfig_s"][::std::mem::size_of::<serialConfig_s>() - 100usize];
    ["Alignment of serialConfig_s"][::std::mem::align_of::<serialConfig_s>() - 4usize];
    ["Offset of field: serialConfig_s::portConfigs"]
        [::std::mem::offset_of!(serialConfig_s, portConfigs) - 0usize];
    ["Offset of field: serialConfig_s::serial_update_rate_hz"]
        [::std::mem::offset_of!(serialConfig_s, serial_update_rate_hz) - 96usize];
    ["Offset of field: serialConfig_s::reboot_character"]
        [::std::mem::offset_of!(serialConfig_s, reboot_character) - 98usize];
};
pub type serialConfig_t = serialConfig_s;
pub type serialConsumer = ::std::option::Option<unsafe extern "C" fn(arg1: u8)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gpsConfig_s {
    pub provider: u8,
    pub sbasMode: u8,
    pub autoConfig: u8,
    pub autoBaud: u8,
    pub gps_ublox_acquire_model: u8,
    pub gps_ublox_flight_model: u8,
    pub gps_update_rate_hz: u8,
    pub gps_ublox_use_galileo: bool,
    pub gps_set_home_point_once: bool,
    pub gps_use_3d_speed: bool,
    pub sbas_integrity: bool,
    pub gps_ublox_utc_standard: u8,
    pub nmeaCustomCommands: [::std::os::raw::c_char; 65usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gpsConfig_s"][::std::mem::size_of::<gpsConfig_s>() - 77usize];
    ["Alignment of gpsConfig_s"][::std::mem::align_of::<gpsConfig_s>() - 1usize];
    ["Offset of field: gpsConfig_s::provider"]
        [::std::mem::offset_of!(gpsConfig_s, provider) - 0usize];
    ["Offset of field: gpsConfig_s::sbasMode"]
        [::std::mem::offset_of!(gpsConfig_s, sbasMode) - 1usize];
    ["Offset of field: gpsConfig_s::autoConfig"]
        [::std::mem::offset_of!(gpsConfig_s, autoConfig) - 2usize];
    ["Offset of field: gpsConfig_s::autoBaud"]
        [::std::mem::offset_of!(gpsConfig_s, autoBaud) - 3usize];
    ["Offset of field: gpsConfig_s::gps_ublox_acquire_model"]
        [::std::mem::offset_of!(gpsConfig_s, gps_ublox_acquire_model) - 4usize];
    ["Offset of field: gpsConfig_s::gps_ublox_flight_model"]
        [::std::mem::offset_of!(gpsConfig_s, gps_ublox_flight_model) - 5usize];
    ["Offset of field: gpsConfig_s::gps_update_rate_hz"]
        [::std::mem::offset_of!(gpsConfig_s, gps_update_rate_hz) - 6usize];
    ["Offset of field: gpsConfig_s::gps_ublox_use_galileo"]
        [::std::mem::offset_of!(gpsConfig_s, gps_ublox_use_galileo) - 7usize];
    ["Offset of field: gpsConfig_s::gps_set_home_point_once"]
        [::std::mem::offset_of!(gpsConfig_s, gps_set_home_point_once) - 8usize];
    ["Offset of field: gpsConfig_s::gps_use_3d_speed"]
        [::std::mem::offset_of!(gpsConfig_s, gps_use_3d_speed) - 9usize];
    ["Offset of field: gpsConfig_s::sbas_integrity"]
        [::std::mem::offset_of!(gpsConfig_s, sbas_integrity) - 10usize];
    ["Offset of field: gpsConfig_s::gps_ublox_utc_standard"]
        [::std::mem::offset_of!(gpsConfig_s, gps_ublox_utc_standard) - 11usize];
    ["Offset of field: gpsConfig_s::nmeaCustomCommands"]
        [::std::mem::offset_of!(gpsConfig_s, nmeaCustomCommands) - 12usize];
};
pub type gpsConfig_t = gpsConfig_s;
pub const ubloxModel_e_UBLOX_MODEL_PORTABLE: ubloxModel_e = 0;
pub const ubloxModel_e_UBLOX_MODEL_STATIONARY: ubloxModel_e = 1;
pub const ubloxModel_e_UBLOX_MODEL_PEDESTRIAN: ubloxModel_e = 2;
pub const ubloxModel_e_UBLOX_MODEL_AUTOMOTIVE: ubloxModel_e = 3;
pub const ubloxModel_e_UBLOX_MODEL_AT_SEA: ubloxModel_e = 4;
pub const ubloxModel_e_UBLOX_MODEL_AIRBORNE_1G: ubloxModel_e = 5;
pub const ubloxModel_e_UBLOX_MODEL_AIRBORNE_2G: ubloxModel_e = 6;
pub const ubloxModel_e_UBLOX_MODEL_AIRBORNE_4G: ubloxModel_e = 7;
pub type ubloxModel_e = ::std::os::raw::c_uint;
pub const ubloxUtcStandard_e_UBLOX_UTC_STANDARD_AUTO: ubloxUtcStandard_e = 0;
pub const ubloxUtcStandard_e_UBLOX_UTC_STANDARD_USNO: ubloxUtcStandard_e = 3;
pub const ubloxUtcStandard_e_UBLOX_UTC_STANDARD_EU: ubloxUtcStandard_e = 5;
pub const ubloxUtcStandard_e_UBLOX_UTC_STANDARD_SU: ubloxUtcStandard_e = 6;
pub const ubloxUtcStandard_e_UBLOX_UTC_STANDARD_NTSC: ubloxUtcStandard_e = 7;
pub type ubloxUtcStandard_e = ::std::os::raw::c_uint;
pub const gpsState_e_GPS_STATE_UNKNOWN: gpsState_e = 0;
pub const gpsState_e_GPS_STATE_DETECT_BAUD: gpsState_e = 1;
pub const gpsState_e_GPS_STATE_INITIALIZED: gpsState_e = 2;
pub const gpsState_e_GPS_STATE_CHANGE_BAUD: gpsState_e = 3;
pub const gpsState_e_GPS_STATE_CONFIGURE: gpsState_e = 4;
pub const gpsState_e_GPS_STATE_RECEIVING_DATA: gpsState_e = 5;
pub const gpsState_e_GPS_STATE_PROCESS_DATA: gpsState_e = 6;
pub const gpsState_e_GPS_STATE_LOST_COMMUNICATION: gpsState_e = 7;
pub const gpsState_e_GPS_STATE_COUNT: gpsState_e = 8;
pub type gpsState_e = ::std::os::raw::c_uint;
pub const gpsCoordinateType_e_GPS_LATITUDE: gpsCoordinateType_e = 0;
pub const gpsCoordinateType_e_GPS_LONGITUDE: gpsCoordinateType_e = 1;
pub type gpsCoordinateType_e = ::std::os::raw::c_uint;
pub const gpsProvider_e_GPS_NMEA: gpsProvider_e = 0;
pub const gpsProvider_e_GPS_UBLOX: gpsProvider_e = 1;
pub const gpsProvider_e_GPS_MSP: gpsProvider_e = 2;
pub type gpsProvider_e = ::std::os::raw::c_uint;
pub const sbasMode_e_SBAS_AUTO: sbasMode_e = 0;
pub const sbasMode_e_SBAS_EGNOS: sbasMode_e = 1;
pub const sbasMode_e_SBAS_WAAS: sbasMode_e = 2;
pub const sbasMode_e_SBAS_MSAS: sbasMode_e = 3;
pub const sbasMode_e_SBAS_GAGAN: sbasMode_e = 4;
pub const sbasMode_e_SBAS_NONE: sbasMode_e = 5;
pub type sbasMode_e = ::std::os::raw::c_uint;
pub const gpsBaudRate_e_GPS_BAUDRATE_115200: gpsBaudRate_e = 0;
pub const gpsBaudRate_e_GPS_BAUDRATE_57600: gpsBaudRate_e = 1;
pub const gpsBaudRate_e_GPS_BAUDRATE_38400: gpsBaudRate_e = 2;
pub const gpsBaudRate_e_GPS_BAUDRATE_19200: gpsBaudRate_e = 3;
pub const gpsBaudRate_e_GPS_BAUDRATE_9600: gpsBaudRate_e = 4;
pub type gpsBaudRate_e = ::std::os::raw::c_uint;
pub const gpsAutoConfig_e_GPS_AUTOCONFIG_OFF: gpsAutoConfig_e = 0;
pub const gpsAutoConfig_e_GPS_AUTOCONFIG_ON: gpsAutoConfig_e = 1;
pub type gpsAutoConfig_e = ::std::os::raw::c_uint;
pub const gpsAutoBaud_e_GPS_AUTOBAUD_OFF: gpsAutoBaud_e = 0;
pub const gpsAutoBaud_e_GPS_AUTOBAUD_ON: gpsAutoBaud_e = 1;
pub type gpsAutoBaud_e = ::std::os::raw::c_uint;
pub const ubloxAckState_e_UBLOX_ACK_IDLE: ubloxAckState_e = 0;
pub const ubloxAckState_e_UBLOX_ACK_WAITING: ubloxAckState_e = 1;
pub const ubloxAckState_e_UBLOX_ACK_GOT_ACK: ubloxAckState_e = 2;
pub const ubloxAckState_e_UBLOX_ACK_GOT_NACK: ubloxAckState_e = 3;
pub type ubloxAckState_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gpsCoordinateDDDMMmmmm_s {
    pub dddmm: i16,
    pub mmmm: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gpsCoordinateDDDMMmmmm_s"]
        [::std::mem::size_of::<gpsCoordinateDDDMMmmmm_s>() - 4usize];
    ["Alignment of gpsCoordinateDDDMMmmmm_s"]
        [::std::mem::align_of::<gpsCoordinateDDDMMmmmm_s>() - 2usize];
    ["Offset of field: gpsCoordinateDDDMMmmmm_s::dddmm"]
        [::std::mem::offset_of!(gpsCoordinateDDDMMmmmm_s, dddmm) - 0usize];
    ["Offset of field: gpsCoordinateDDDMMmmmm_s::mmmm"]
        [::std::mem::offset_of!(gpsCoordinateDDDMMmmmm_s, mmmm) - 2usize];
};
pub type gpsCoordinateDDDMMmmmm_t = gpsCoordinateDDDMMmmmm_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gpsLocation_s {
    pub lat: i32,
    pub lon: i32,
    pub altCm: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gpsLocation_s"][::std::mem::size_of::<gpsLocation_s>() - 12usize];
    ["Alignment of gpsLocation_s"][::std::mem::align_of::<gpsLocation_s>() - 4usize];
    ["Offset of field: gpsLocation_s::lat"][::std::mem::offset_of!(gpsLocation_s, lat) - 0usize];
    ["Offset of field: gpsLocation_s::lon"][::std::mem::offset_of!(gpsLocation_s, lon) - 4usize];
    ["Offset of field: gpsLocation_s::altCm"]
        [::std::mem::offset_of!(gpsLocation_s, altCm) - 8usize];
};
pub type gpsLocation_t = gpsLocation_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gpsDilution_s {
    pub pdop: u16,
    pub hdop: u16,
    pub vdop: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gpsDilution_s"][::std::mem::size_of::<gpsDilution_s>() - 6usize];
    ["Alignment of gpsDilution_s"][::std::mem::align_of::<gpsDilution_s>() - 2usize];
    ["Offset of field: gpsDilution_s::pdop"][::std::mem::offset_of!(gpsDilution_s, pdop) - 0usize];
    ["Offset of field: gpsDilution_s::hdop"][::std::mem::offset_of!(gpsDilution_s, hdop) - 2usize];
    ["Offset of field: gpsDilution_s::vdop"][::std::mem::offset_of!(gpsDilution_s, vdop) - 4usize];
};
pub type gpsDilution_t = gpsDilution_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gpsAccuracy_s {
    pub hAcc: u32,
    pub vAcc: u32,
    pub sAcc: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gpsAccuracy_s"][::std::mem::size_of::<gpsAccuracy_s>() - 12usize];
    ["Alignment of gpsAccuracy_s"][::std::mem::align_of::<gpsAccuracy_s>() - 4usize];
    ["Offset of field: gpsAccuracy_s::hAcc"][::std::mem::offset_of!(gpsAccuracy_s, hAcc) - 0usize];
    ["Offset of field: gpsAccuracy_s::vAcc"][::std::mem::offset_of!(gpsAccuracy_s, vAcc) - 4usize];
    ["Offset of field: gpsAccuracy_s::sAcc"][::std::mem::offset_of!(gpsAccuracy_s, sAcc) - 8usize];
};
pub type gpsAccuracy_t = gpsAccuracy_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gpsSolutionData_s {
    pub llh: gpsLocation_t,
    pub dop: gpsDilution_t,
    pub acc: gpsAccuracy_t,
    pub speed3d: u16,
    pub groundSpeed: u16,
    pub groundCourse: u16,
    pub numSat: u8,
    pub time: u32,
    pub navIntervalMs: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gpsSolutionData_s"][::std::mem::size_of::<gpsSolutionData_s>() - 48usize];
    ["Alignment of gpsSolutionData_s"][::std::mem::align_of::<gpsSolutionData_s>() - 4usize];
    ["Offset of field: gpsSolutionData_s::llh"]
        [::std::mem::offset_of!(gpsSolutionData_s, llh) - 0usize];
    ["Offset of field: gpsSolutionData_s::dop"]
        [::std::mem::offset_of!(gpsSolutionData_s, dop) - 12usize];
    ["Offset of field: gpsSolutionData_s::acc"]
        [::std::mem::offset_of!(gpsSolutionData_s, acc) - 20usize];
    ["Offset of field: gpsSolutionData_s::speed3d"]
        [::std::mem::offset_of!(gpsSolutionData_s, speed3d) - 32usize];
    ["Offset of field: gpsSolutionData_s::groundSpeed"]
        [::std::mem::offset_of!(gpsSolutionData_s, groundSpeed) - 34usize];
    ["Offset of field: gpsSolutionData_s::groundCourse"]
        [::std::mem::offset_of!(gpsSolutionData_s, groundCourse) - 36usize];
    ["Offset of field: gpsSolutionData_s::numSat"]
        [::std::mem::offset_of!(gpsSolutionData_s, numSat) - 38usize];
    ["Offset of field: gpsSolutionData_s::time"]
        [::std::mem::offset_of!(gpsSolutionData_s, time) - 40usize];
    ["Offset of field: gpsSolutionData_s::navIntervalMs"]
        [::std::mem::offset_of!(gpsSolutionData_s, navIntervalMs) - 44usize];
};
pub type gpsSolutionData_t = gpsSolutionData_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ubxMonVer_s {
    pub swVersion: [::std::os::raw::c_char; 30usize],
    pub hwVersion: [::std::os::raw::c_char; 10usize],
    pub extension: [::std::os::raw::c_char; 300usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ubxMonVer_s"][::std::mem::size_of::<ubxMonVer_s>() - 340usize];
    ["Alignment of ubxMonVer_s"][::std::mem::align_of::<ubxMonVer_s>() - 1usize];
    ["Offset of field: ubxMonVer_s::swVersion"]
        [::std::mem::offset_of!(ubxMonVer_s, swVersion) - 0usize];
    ["Offset of field: ubxMonVer_s::hwVersion"]
        [::std::mem::offset_of!(ubxMonVer_s, hwVersion) - 30usize];
    ["Offset of field: ubxMonVer_s::extension"]
        [::std::mem::offset_of!(ubxMonVer_s, extension) - 40usize];
};
pub type ubxMonVer_t = ubxMonVer_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gpsData_s {
    pub errors: u32,
    pub timeouts: u32,
    pub lastNavMessage: u32,
    pub now: u32,
    pub lastMessageSent: u32,
    pub state_position: u32,
    pub state_ts: u32,
    pub state: u8,
    pub userBaudRateIndex: u8,
    pub tempBaudRateIndex: u8,
    pub ackWaitingMsgId: u8,
    pub ackState: ubloxAckState_e,
    pub updateRateHz: u8,
    pub ubloxM7orAbove: bool,
    pub ubloxM8orAbove: bool,
    pub ubloxM9orAbove: bool,
    pub ubloxUsingFlightModel: bool,
    pub satMessagesDisabled: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gpsData_s"][::std::mem::size_of::<gpsData_s>() - 44usize];
    ["Alignment of gpsData_s"][::std::mem::align_of::<gpsData_s>() - 4usize];
    ["Offset of field: gpsData_s::errors"][::std::mem::offset_of!(gpsData_s, errors) - 0usize];
    ["Offset of field: gpsData_s::timeouts"][::std::mem::offset_of!(gpsData_s, timeouts) - 4usize];
    ["Offset of field: gpsData_s::lastNavMessage"]
        [::std::mem::offset_of!(gpsData_s, lastNavMessage) - 8usize];
    ["Offset of field: gpsData_s::now"][::std::mem::offset_of!(gpsData_s, now) - 12usize];
    ["Offset of field: gpsData_s::lastMessageSent"]
        [::std::mem::offset_of!(gpsData_s, lastMessageSent) - 16usize];
    ["Offset of field: gpsData_s::state_position"]
        [::std::mem::offset_of!(gpsData_s, state_position) - 20usize];
    ["Offset of field: gpsData_s::state_ts"][::std::mem::offset_of!(gpsData_s, state_ts) - 24usize];
    ["Offset of field: gpsData_s::state"][::std::mem::offset_of!(gpsData_s, state) - 28usize];
    ["Offset of field: gpsData_s::userBaudRateIndex"]
        [::std::mem::offset_of!(gpsData_s, userBaudRateIndex) - 29usize];
    ["Offset of field: gpsData_s::tempBaudRateIndex"]
        [::std::mem::offset_of!(gpsData_s, tempBaudRateIndex) - 30usize];
    ["Offset of field: gpsData_s::ackWaitingMsgId"]
        [::std::mem::offset_of!(gpsData_s, ackWaitingMsgId) - 31usize];
    ["Offset of field: gpsData_s::ackState"][::std::mem::offset_of!(gpsData_s, ackState) - 32usize];
    ["Offset of field: gpsData_s::updateRateHz"]
        [::std::mem::offset_of!(gpsData_s, updateRateHz) - 36usize];
    ["Offset of field: gpsData_s::ubloxM7orAbove"]
        [::std::mem::offset_of!(gpsData_s, ubloxM7orAbove) - 37usize];
    ["Offset of field: gpsData_s::ubloxM8orAbove"]
        [::std::mem::offset_of!(gpsData_s, ubloxM8orAbove) - 38usize];
    ["Offset of field: gpsData_s::ubloxM9orAbove"]
        [::std::mem::offset_of!(gpsData_s, ubloxM9orAbove) - 39usize];
    ["Offset of field: gpsData_s::ubloxUsingFlightModel"]
        [::std::mem::offset_of!(gpsData_s, ubloxUsingFlightModel) - 40usize];
    ["Offset of field: gpsData_s::satMessagesDisabled"]
        [::std::mem::offset_of!(gpsData_s, satMessagesDisabled) - 41usize];
};
pub type gpsData_t = gpsData_s;
pub const gpsUpdateToggle_e_GPS_DIRECT_TICK: gpsUpdateToggle_e = 1;
pub const gpsUpdateToggle_e_GPS_MSP_UPDATE: gpsUpdateToggle_e = 2;
pub type gpsUpdateToggle_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rxConfig_s {
    pub rcmap: [u8; 8usize],
    pub serialrx_provider: u8,
    pub serialrx_inverted: u8,
    pub halfDuplex: u8,
    pub spektrum_bind_pin_override_ioTag: ioTag_t,
    pub spektrum_bind_plug_ioTag: ioTag_t,
    pub spektrum_sat_bind: u8,
    pub spektrum_sat_bind_autoreset: u8,
    pub rssi_channel: u8,
    pub rssi_scale: u8,
    pub rssi_invert: u8,
    pub midrc: u16,
    pub mincheck: u16,
    pub maxcheck: u16,
    pub fpvCamAngleDegrees: u8,
    pub airModeActivateThreshold: u8,
    pub rx_min_usec: u16,
    pub rx_max_usec: u16,
    pub max_aux_channel: u8,
    pub rssi_src_frame_errors: u8,
    pub rssi_offset: i8,
    pub rc_smoothing_mode: u8,
    pub rc_smoothing_setpoint_cutoff: u8,
    pub rc_smoothing_feedforward_cutoff: u8,
    pub rc_smoothing_throttle_cutoff: u8,
    pub rc_smoothing_debug_axis: u8,
    pub rc_smoothing_auto_factor_rpy: u8,
    pub rc_smoothing_auto_factor_throttle: u8,
    pub rssi_src_frame_lpf_period: u8,
    pub rssi_smoothing: u8,
    pub srxl2_unit_id: u8,
    pub srxl2_baud_fast: u8,
    pub sbus_baud_fast: u8,
    pub msp_override_channels_mask: u32,
    pub crsf_use_negotiated_baud: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rxConfig_s"][::std::mem::size_of::<rxConfig_s>() - 56usize];
    ["Alignment of rxConfig_s"][::std::mem::align_of::<rxConfig_s>() - 4usize];
    ["Offset of field: rxConfig_s::rcmap"][::std::mem::offset_of!(rxConfig_s, rcmap) - 0usize];
    ["Offset of field: rxConfig_s::serialrx_provider"]
        [::std::mem::offset_of!(rxConfig_s, serialrx_provider) - 8usize];
    ["Offset of field: rxConfig_s::serialrx_inverted"]
        [::std::mem::offset_of!(rxConfig_s, serialrx_inverted) - 9usize];
    ["Offset of field: rxConfig_s::halfDuplex"]
        [::std::mem::offset_of!(rxConfig_s, halfDuplex) - 10usize];
    ["Offset of field: rxConfig_s::spektrum_bind_pin_override_ioTag"]
        [::std::mem::offset_of!(rxConfig_s, spektrum_bind_pin_override_ioTag) - 11usize];
    ["Offset of field: rxConfig_s::spektrum_bind_plug_ioTag"]
        [::std::mem::offset_of!(rxConfig_s, spektrum_bind_plug_ioTag) - 12usize];
    ["Offset of field: rxConfig_s::spektrum_sat_bind"]
        [::std::mem::offset_of!(rxConfig_s, spektrum_sat_bind) - 13usize];
    ["Offset of field: rxConfig_s::spektrum_sat_bind_autoreset"]
        [::std::mem::offset_of!(rxConfig_s, spektrum_sat_bind_autoreset) - 14usize];
    ["Offset of field: rxConfig_s::rssi_channel"]
        [::std::mem::offset_of!(rxConfig_s, rssi_channel) - 15usize];
    ["Offset of field: rxConfig_s::rssi_scale"]
        [::std::mem::offset_of!(rxConfig_s, rssi_scale) - 16usize];
    ["Offset of field: rxConfig_s::rssi_invert"]
        [::std::mem::offset_of!(rxConfig_s, rssi_invert) - 17usize];
    ["Offset of field: rxConfig_s::midrc"][::std::mem::offset_of!(rxConfig_s, midrc) - 18usize];
    ["Offset of field: rxConfig_s::mincheck"]
        [::std::mem::offset_of!(rxConfig_s, mincheck) - 20usize];
    ["Offset of field: rxConfig_s::maxcheck"]
        [::std::mem::offset_of!(rxConfig_s, maxcheck) - 22usize];
    ["Offset of field: rxConfig_s::fpvCamAngleDegrees"]
        [::std::mem::offset_of!(rxConfig_s, fpvCamAngleDegrees) - 24usize];
    ["Offset of field: rxConfig_s::airModeActivateThreshold"]
        [::std::mem::offset_of!(rxConfig_s, airModeActivateThreshold) - 25usize];
    ["Offset of field: rxConfig_s::rx_min_usec"]
        [::std::mem::offset_of!(rxConfig_s, rx_min_usec) - 26usize];
    ["Offset of field: rxConfig_s::rx_max_usec"]
        [::std::mem::offset_of!(rxConfig_s, rx_max_usec) - 28usize];
    ["Offset of field: rxConfig_s::max_aux_channel"]
        [::std::mem::offset_of!(rxConfig_s, max_aux_channel) - 30usize];
    ["Offset of field: rxConfig_s::rssi_src_frame_errors"]
        [::std::mem::offset_of!(rxConfig_s, rssi_src_frame_errors) - 31usize];
    ["Offset of field: rxConfig_s::rssi_offset"]
        [::std::mem::offset_of!(rxConfig_s, rssi_offset) - 32usize];
    ["Offset of field: rxConfig_s::rc_smoothing_mode"]
        [::std::mem::offset_of!(rxConfig_s, rc_smoothing_mode) - 33usize];
    ["Offset of field: rxConfig_s::rc_smoothing_setpoint_cutoff"]
        [::std::mem::offset_of!(rxConfig_s, rc_smoothing_setpoint_cutoff) - 34usize];
    ["Offset of field: rxConfig_s::rc_smoothing_feedforward_cutoff"]
        [::std::mem::offset_of!(rxConfig_s, rc_smoothing_feedforward_cutoff) - 35usize];
    ["Offset of field: rxConfig_s::rc_smoothing_throttle_cutoff"]
        [::std::mem::offset_of!(rxConfig_s, rc_smoothing_throttle_cutoff) - 36usize];
    ["Offset of field: rxConfig_s::rc_smoothing_debug_axis"]
        [::std::mem::offset_of!(rxConfig_s, rc_smoothing_debug_axis) - 37usize];
    ["Offset of field: rxConfig_s::rc_smoothing_auto_factor_rpy"]
        [::std::mem::offset_of!(rxConfig_s, rc_smoothing_auto_factor_rpy) - 38usize];
    ["Offset of field: rxConfig_s::rc_smoothing_auto_factor_throttle"]
        [::std::mem::offset_of!(rxConfig_s, rc_smoothing_auto_factor_throttle) - 39usize];
    ["Offset of field: rxConfig_s::rssi_src_frame_lpf_period"]
        [::std::mem::offset_of!(rxConfig_s, rssi_src_frame_lpf_period) - 40usize];
    ["Offset of field: rxConfig_s::rssi_smoothing"]
        [::std::mem::offset_of!(rxConfig_s, rssi_smoothing) - 41usize];
    ["Offset of field: rxConfig_s::srxl2_unit_id"]
        [::std::mem::offset_of!(rxConfig_s, srxl2_unit_id) - 42usize];
    ["Offset of field: rxConfig_s::srxl2_baud_fast"]
        [::std::mem::offset_of!(rxConfig_s, srxl2_baud_fast) - 43usize];
    ["Offset of field: rxConfig_s::sbus_baud_fast"]
        [::std::mem::offset_of!(rxConfig_s, sbus_baud_fast) - 44usize];
    ["Offset of field: rxConfig_s::msp_override_channels_mask"]
        [::std::mem::offset_of!(rxConfig_s, msp_override_channels_mask) - 48usize];
    ["Offset of field: rxConfig_s::crsf_use_negotiated_baud"]
        [::std::mem::offset_of!(rxConfig_s, crsf_use_negotiated_baud) - 52usize];
};
pub type rxConfig_t = rxConfig_s;
pub const rxFrameState_e_RX_FRAME_PENDING: rxFrameState_e = 0;
pub const rxFrameState_e_RX_FRAME_COMPLETE: rxFrameState_e = 1;
pub const rxFrameState_e_RX_FRAME_FAILSAFE: rxFrameState_e = 2;
pub const rxFrameState_e_RX_FRAME_PROCESSING_REQUIRED: rxFrameState_e = 4;
pub const rxFrameState_e_RX_FRAME_DROPPED: rxFrameState_e = 8;
pub type rxFrameState_e = ::std::os::raw::c_uint;
pub const SerialRXType_SERIALRX_NONE: SerialRXType = 0;
pub const SerialRXType_SERIALRX_SPEKTRUM2048: SerialRXType = 1;
pub const SerialRXType_SERIALRX_SBUS: SerialRXType = 2;
pub const SerialRXType_SERIALRX_SUMD: SerialRXType = 3;
pub const SerialRXType_SERIALRX_SUMH: SerialRXType = 4;
pub const SerialRXType_SERIALRX_XBUS_MODE_B: SerialRXType = 5;
pub const SerialRXType_SERIALRX_XBUS_MODE_B_RJ01: SerialRXType = 6;
pub const SerialRXType_SERIALRX_IBUS: SerialRXType = 7;
pub const SerialRXType_SERIALRX_JETIEXBUS: SerialRXType = 8;
pub const SerialRXType_SERIALRX_CRSF: SerialRXType = 9;
pub const SerialRXType_SERIALRX_SRXL: SerialRXType = 10;
pub const SerialRXType_SERIALRX_TARGET_CUSTOM: SerialRXType = 11;
pub const SerialRXType_SERIALRX_FPORT: SerialRXType = 12;
pub const SerialRXType_SERIALRX_SRXL2: SerialRXType = 13;
pub const SerialRXType_SERIALRX_GHST: SerialRXType = 14;
pub const SerialRXType_SERIALRX_SPEKTRUM1024: SerialRXType = 15;
pub type SerialRXType = ::std::os::raw::c_uint;
pub const rxFailsafeChannelMode_e_RX_FAILSAFE_MODE_AUTO: rxFailsafeChannelMode_e = 0;
pub const rxFailsafeChannelMode_e_RX_FAILSAFE_MODE_HOLD: rxFailsafeChannelMode_e = 1;
pub const rxFailsafeChannelMode_e_RX_FAILSAFE_MODE_SET: rxFailsafeChannelMode_e = 2;
pub const rxFailsafeChannelMode_e_RX_FAILSAFE_MODE_INVALID: rxFailsafeChannelMode_e = 3;
pub type rxFailsafeChannelMode_e = ::std::os::raw::c_uint;
pub const rxFailsafeChannelType_e_RX_FAILSAFE_TYPE_FLIGHT: rxFailsafeChannelType_e = 0;
pub const rxFailsafeChannelType_e_RX_FAILSAFE_TYPE_AUX: rxFailsafeChannelType_e = 1;
pub type rxFailsafeChannelType_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rxFailsafeChannelConfig_s {
    pub mode: u8,
    pub step: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rxFailsafeChannelConfig_s"]
        [::std::mem::size_of::<rxFailsafeChannelConfig_s>() - 2usize];
    ["Alignment of rxFailsafeChannelConfig_s"]
        [::std::mem::align_of::<rxFailsafeChannelConfig_s>() - 1usize];
    ["Offset of field: rxFailsafeChannelConfig_s::mode"]
        [::std::mem::offset_of!(rxFailsafeChannelConfig_s, mode) - 0usize];
    ["Offset of field: rxFailsafeChannelConfig_s::step"]
        [::std::mem::offset_of!(rxFailsafeChannelConfig_s, step) - 1usize];
};
pub type rxFailsafeChannelConfig_t = rxFailsafeChannelConfig_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rxChannelRangeConfig_s {
    pub min: u16,
    pub max: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rxChannelRangeConfig_s"][::std::mem::size_of::<rxChannelRangeConfig_s>() - 4usize];
    ["Alignment of rxChannelRangeConfig_s"]
        [::std::mem::align_of::<rxChannelRangeConfig_s>() - 2usize];
    ["Offset of field: rxChannelRangeConfig_s::min"]
        [::std::mem::offset_of!(rxChannelRangeConfig_s, min) - 0usize];
    ["Offset of field: rxChannelRangeConfig_s::max"]
        [::std::mem::offset_of!(rxChannelRangeConfig_s, max) - 2usize];
};
pub type rxChannelRangeConfig_t = rxChannelRangeConfig_s;
pub type rcReadRawDataFnPtr = ::std::option::Option<
    unsafe extern "C" fn(rxRuntimeState: *const rxRuntimeState_s, chan: u8) -> f32,
>;
pub type rcFrameStatusFnPtr =
    ::std::option::Option<unsafe extern "C" fn(rxRuntimeState: *mut rxRuntimeState_s) -> u8>;
pub type rcProcessFrameFnPtr =
    ::std::option::Option<unsafe extern "C" fn(rxRuntimeState: *const rxRuntimeState_s) -> bool>;
pub type rcGetFrameTimeUsFn = ::std::option::Option<unsafe extern "C" fn() -> timeUs_t>;
pub const rxProvider_t_RX_PROVIDER_NONE: rxProvider_t = 0;
pub const rxProvider_t_RX_PROVIDER_PARALLEL_PWM: rxProvider_t = 1;
pub const rxProvider_t_RX_PROVIDER_PPM: rxProvider_t = 2;
pub const rxProvider_t_RX_PROVIDER_SERIAL: rxProvider_t = 3;
pub const rxProvider_t_RX_PROVIDER_MSP: rxProvider_t = 4;
pub const rxProvider_t_RX_PROVIDER_SPI: rxProvider_t = 5;
pub const rxProvider_t_RX_PROVIDER_UDP: rxProvider_t = 6;
pub type rxProvider_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rxRuntimeState_s {
    pub rxProvider: rxProvider_t,
    pub serialrxProvider: SerialRXType,
    pub channelCount: u8,
    pub rcReadRawFn: rcReadRawDataFnPtr,
    pub rcFrameStatusFn: rcFrameStatusFnPtr,
    pub rcProcessFrameFn: rcProcessFrameFnPtr,
    pub rcFrameTimeUsFn: rcGetFrameTimeUsFn,
    pub channelData: *mut u16,
    pub frameData: *mut ::std::os::raw::c_void,
    pub lastRcFrameTimeUs: timeUs_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rxRuntimeState_s"][::std::mem::size_of::<rxRuntimeState_s>() - 72usize];
    ["Alignment of rxRuntimeState_s"][::std::mem::align_of::<rxRuntimeState_s>() - 8usize];
    ["Offset of field: rxRuntimeState_s::rxProvider"]
        [::std::mem::offset_of!(rxRuntimeState_s, rxProvider) - 0usize];
    ["Offset of field: rxRuntimeState_s::serialrxProvider"]
        [::std::mem::offset_of!(rxRuntimeState_s, serialrxProvider) - 4usize];
    ["Offset of field: rxRuntimeState_s::channelCount"]
        [::std::mem::offset_of!(rxRuntimeState_s, channelCount) - 8usize];
    ["Offset of field: rxRuntimeState_s::rcReadRawFn"]
        [::std::mem::offset_of!(rxRuntimeState_s, rcReadRawFn) - 16usize];
    ["Offset of field: rxRuntimeState_s::rcFrameStatusFn"]
        [::std::mem::offset_of!(rxRuntimeState_s, rcFrameStatusFn) - 24usize];
    ["Offset of field: rxRuntimeState_s::rcProcessFrameFn"]
        [::std::mem::offset_of!(rxRuntimeState_s, rcProcessFrameFn) - 32usize];
    ["Offset of field: rxRuntimeState_s::rcFrameTimeUsFn"]
        [::std::mem::offset_of!(rxRuntimeState_s, rcFrameTimeUsFn) - 40usize];
    ["Offset of field: rxRuntimeState_s::channelData"]
        [::std::mem::offset_of!(rxRuntimeState_s, channelData) - 48usize];
    ["Offset of field: rxRuntimeState_s::frameData"]
        [::std::mem::offset_of!(rxRuntimeState_s, frameData) - 56usize];
    ["Offset of field: rxRuntimeState_s::lastRcFrameTimeUs"]
        [::std::mem::offset_of!(rxRuntimeState_s, lastRcFrameTimeUs) - 64usize];
};
pub type rxRuntimeState_t = rxRuntimeState_s;
pub const rssiSource_e_RSSI_SOURCE_NONE: rssiSource_e = 0;
pub const rssiSource_e_RSSI_SOURCE_ADC: rssiSource_e = 1;
pub const rssiSource_e_RSSI_SOURCE_RX_CHANNEL: rssiSource_e = 2;
pub const rssiSource_e_RSSI_SOURCE_RX_PROTOCOL: rssiSource_e = 3;
pub const rssiSource_e_RSSI_SOURCE_MSP: rssiSource_e = 4;
pub const rssiSource_e_RSSI_SOURCE_FRAME_ERRORS: rssiSource_e = 5;
pub const rssiSource_e_RSSI_SOURCE_RX_PROTOCOL_CRSF: rssiSource_e = 6;
pub type rssiSource_e = ::std::os::raw::c_uint;
pub const linkQualitySource_e_LQ_SOURCE_NONE: linkQualitySource_e = 0;
pub const linkQualitySource_e_LQ_SOURCE_RX_PROTOCOL_CRSF: linkQualitySource_e = 1;
pub const linkQualitySource_e_LQ_SOURCE_RX_PROTOCOL_GHST: linkQualitySource_e = 2;
pub type linkQualitySource_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct filter_s {
    _unused: [u8; 0],
}
pub type filter_t = filter_s;
pub type filterApplyFnPtr =
    ::std::option::Option<unsafe extern "C" fn(filter: *mut filter_t, input: f32) -> f32>;
pub const lowpassFilterType_e_FILTER_PT1: lowpassFilterType_e = 0;
pub const lowpassFilterType_e_FILTER_BIQUAD: lowpassFilterType_e = 1;
pub const lowpassFilterType_e_FILTER_PT2: lowpassFilterType_e = 2;
pub const lowpassFilterType_e_FILTER_PT3: lowpassFilterType_e = 3;
pub type lowpassFilterType_e = ::std::os::raw::c_uint;
pub const biquadFilterType_e_FILTER_LPF: biquadFilterType_e = 0;
pub const biquadFilterType_e_FILTER_NOTCH: biquadFilterType_e = 1;
pub const biquadFilterType_e_FILTER_BPF: biquadFilterType_e = 2;
pub type biquadFilterType_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pt1Filter_s {
    pub state: f32,
    pub k: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pt1Filter_s"][::std::mem::size_of::<pt1Filter_s>() - 8usize];
    ["Alignment of pt1Filter_s"][::std::mem::align_of::<pt1Filter_s>() - 4usize];
    ["Offset of field: pt1Filter_s::state"][::std::mem::offset_of!(pt1Filter_s, state) - 0usize];
    ["Offset of field: pt1Filter_s::k"][::std::mem::offset_of!(pt1Filter_s, k) - 4usize];
};
pub type pt1Filter_t = pt1Filter_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pt2Filter_s {
    pub state: f32,
    pub state1: f32,
    pub k: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pt2Filter_s"][::std::mem::size_of::<pt2Filter_s>() - 12usize];
    ["Alignment of pt2Filter_s"][::std::mem::align_of::<pt2Filter_s>() - 4usize];
    ["Offset of field: pt2Filter_s::state"][::std::mem::offset_of!(pt2Filter_s, state) - 0usize];
    ["Offset of field: pt2Filter_s::state1"][::std::mem::offset_of!(pt2Filter_s, state1) - 4usize];
    ["Offset of field: pt2Filter_s::k"][::std::mem::offset_of!(pt2Filter_s, k) - 8usize];
};
pub type pt2Filter_t = pt2Filter_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pt3Filter_s {
    pub state: f32,
    pub state1: f32,
    pub state2: f32,
    pub k: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pt3Filter_s"][::std::mem::size_of::<pt3Filter_s>() - 16usize];
    ["Alignment of pt3Filter_s"][::std::mem::align_of::<pt3Filter_s>() - 4usize];
    ["Offset of field: pt3Filter_s::state"][::std::mem::offset_of!(pt3Filter_s, state) - 0usize];
    ["Offset of field: pt3Filter_s::state1"][::std::mem::offset_of!(pt3Filter_s, state1) - 4usize];
    ["Offset of field: pt3Filter_s::state2"][::std::mem::offset_of!(pt3Filter_s, state2) - 8usize];
    ["Offset of field: pt3Filter_s::k"][::std::mem::offset_of!(pt3Filter_s, k) - 12usize];
};
pub type pt3Filter_t = pt3Filter_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct biquadFilter_s {
    pub b0: f32,
    pub b1: f32,
    pub b2: f32,
    pub a1: f32,
    pub a2: f32,
    pub x1: f32,
    pub x2: f32,
    pub y1: f32,
    pub y2: f32,
    pub weight: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of biquadFilter_s"][::std::mem::size_of::<biquadFilter_s>() - 40usize];
    ["Alignment of biquadFilter_s"][::std::mem::align_of::<biquadFilter_s>() - 4usize];
    ["Offset of field: biquadFilter_s::b0"][::std::mem::offset_of!(biquadFilter_s, b0) - 0usize];
    ["Offset of field: biquadFilter_s::b1"][::std::mem::offset_of!(biquadFilter_s, b1) - 4usize];
    ["Offset of field: biquadFilter_s::b2"][::std::mem::offset_of!(biquadFilter_s, b2) - 8usize];
    ["Offset of field: biquadFilter_s::a1"][::std::mem::offset_of!(biquadFilter_s, a1) - 12usize];
    ["Offset of field: biquadFilter_s::a2"][::std::mem::offset_of!(biquadFilter_s, a2) - 16usize];
    ["Offset of field: biquadFilter_s::x1"][::std::mem::offset_of!(biquadFilter_s, x1) - 20usize];
    ["Offset of field: biquadFilter_s::x2"][::std::mem::offset_of!(biquadFilter_s, x2) - 24usize];
    ["Offset of field: biquadFilter_s::y1"][::std::mem::offset_of!(biquadFilter_s, y1) - 28usize];
    ["Offset of field: biquadFilter_s::y2"][::std::mem::offset_of!(biquadFilter_s, y2) - 32usize];
    ["Offset of field: biquadFilter_s::weight"]
        [::std::mem::offset_of!(biquadFilter_s, weight) - 36usize];
};
pub type biquadFilter_t = biquadFilter_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct phaseComp_s {
    pub b0: f32,
    pub b1: f32,
    pub a1: f32,
    pub x1: f32,
    pub y1: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of phaseComp_s"][::std::mem::size_of::<phaseComp_s>() - 20usize];
    ["Alignment of phaseComp_s"][::std::mem::align_of::<phaseComp_s>() - 4usize];
    ["Offset of field: phaseComp_s::b0"][::std::mem::offset_of!(phaseComp_s, b0) - 0usize];
    ["Offset of field: phaseComp_s::b1"][::std::mem::offset_of!(phaseComp_s, b1) - 4usize];
    ["Offset of field: phaseComp_s::a1"][::std::mem::offset_of!(phaseComp_s, a1) - 8usize];
    ["Offset of field: phaseComp_s::x1"][::std::mem::offset_of!(phaseComp_s, x1) - 12usize];
    ["Offset of field: phaseComp_s::y1"][::std::mem::offset_of!(phaseComp_s, y1) - 16usize];
};
pub type phaseComp_t = phaseComp_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slewFilter_s {
    pub state: f32,
    pub slewLimit: f32,
    pub threshold: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of slewFilter_s"][::std::mem::size_of::<slewFilter_s>() - 12usize];
    ["Alignment of slewFilter_s"][::std::mem::align_of::<slewFilter_s>() - 4usize];
    ["Offset of field: slewFilter_s::state"][::std::mem::offset_of!(slewFilter_s, state) - 0usize];
    ["Offset of field: slewFilter_s::slewLimit"]
        [::std::mem::offset_of!(slewFilter_s, slewLimit) - 4usize];
    ["Offset of field: slewFilter_s::threshold"]
        [::std::mem::offset_of!(slewFilter_s, threshold) - 8usize];
};
pub type slewFilter_t = slewFilter_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct laggedMovingAverage_s {
    pub movingWindowIndex: u16,
    pub windowSize: u16,
    pub movingSum: f32,
    pub buf: *mut f32,
    pub primed: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of laggedMovingAverage_s"][::std::mem::size_of::<laggedMovingAverage_s>() - 24usize];
    ["Alignment of laggedMovingAverage_s"]
        [::std::mem::align_of::<laggedMovingAverage_s>() - 8usize];
    ["Offset of field: laggedMovingAverage_s::movingWindowIndex"]
        [::std::mem::offset_of!(laggedMovingAverage_s, movingWindowIndex) - 0usize];
    ["Offset of field: laggedMovingAverage_s::windowSize"]
        [::std::mem::offset_of!(laggedMovingAverage_s, windowSize) - 2usize];
    ["Offset of field: laggedMovingAverage_s::movingSum"]
        [::std::mem::offset_of!(laggedMovingAverage_s, movingSum) - 4usize];
    ["Offset of field: laggedMovingAverage_s::buf"]
        [::std::mem::offset_of!(laggedMovingAverage_s, buf) - 8usize];
    ["Offset of field: laggedMovingAverage_s::primed"]
        [::std::mem::offset_of!(laggedMovingAverage_s, primed) - 16usize];
};
pub type laggedMovingAverage_t = laggedMovingAverage_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct simpleLowpassFilter_s {
    pub fp: i32,
    pub beta: i32,
    pub fpShift: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of simpleLowpassFilter_s"][::std::mem::size_of::<simpleLowpassFilter_s>() - 12usize];
    ["Alignment of simpleLowpassFilter_s"]
        [::std::mem::align_of::<simpleLowpassFilter_s>() - 4usize];
    ["Offset of field: simpleLowpassFilter_s::fp"]
        [::std::mem::offset_of!(simpleLowpassFilter_s, fp) - 0usize];
    ["Offset of field: simpleLowpassFilter_s::beta"]
        [::std::mem::offset_of!(simpleLowpassFilter_s, beta) - 4usize];
    ["Offset of field: simpleLowpassFilter_s::fpShift"]
        [::std::mem::offset_of!(simpleLowpassFilter_s, fpShift) - 8usize];
};
pub type simpleLowpassFilter_t = simpleLowpassFilter_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct meanAccumulator_s {
    pub accumulator: i32,
    pub count: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of meanAccumulator_s"][::std::mem::size_of::<meanAccumulator_s>() - 8usize];
    ["Alignment of meanAccumulator_s"][::std::mem::align_of::<meanAccumulator_s>() - 4usize];
    ["Offset of field: meanAccumulator_s::accumulator"]
        [::std::mem::offset_of!(meanAccumulator_s, accumulator) - 0usize];
    ["Offset of field: meanAccumulator_s::count"]
        [::std::mem::offset_of!(meanAccumulator_s, count) - 4usize];
};
pub type meanAccumulator_t = meanAccumulator_s;
pub const currentMeterId_e_CURRENT_METER_ID_NONE: currentMeterId_e = 0;
pub const currentMeterId_e_CURRENT_METER_ID_BATTERY_1: currentMeterId_e = 10;
pub const currentMeterId_e_CURRENT_METER_ID_BATTERY_2: currentMeterId_e = 11;
pub const currentMeterId_e_CURRENT_METER_ID_BATTERY_10: currentMeterId_e = 19;
pub const currentMeterId_e_CURRENT_METER_ID_5V_1: currentMeterId_e = 20;
pub const currentMeterId_e_CURRENT_METER_ID_5V_2: currentMeterId_e = 21;
pub const currentMeterId_e_CURRENT_METER_ID_5V_10: currentMeterId_e = 29;
pub const currentMeterId_e_CURRENT_METER_ID_9V_1: currentMeterId_e = 30;
pub const currentMeterId_e_CURRENT_METER_ID_9V_2: currentMeterId_e = 31;
pub const currentMeterId_e_CURRENT_METER_ID_9V_10: currentMeterId_e = 39;
pub const currentMeterId_e_CURRENT_METER_ID_12V_1: currentMeterId_e = 40;
pub const currentMeterId_e_CURRENT_METER_ID_12V_2: currentMeterId_e = 41;
pub const currentMeterId_e_CURRENT_METER_ID_12V_10: currentMeterId_e = 49;
pub const currentMeterId_e_CURRENT_METER_ID_ESC_COMBINED_1: currentMeterId_e = 50;
pub const currentMeterId_e_CURRENT_METER_ID_ESC_COMBINED_10: currentMeterId_e = 59;
pub const currentMeterId_e_CURRENT_METER_ID_ESC_MOTOR_1: currentMeterId_e = 60;
pub const currentMeterId_e_CURRENT_METER_ID_ESC_MOTOR_2: currentMeterId_e = 61;
pub const currentMeterId_e_CURRENT_METER_ID_ESC_MOTOR_3: currentMeterId_e = 62;
pub const currentMeterId_e_CURRENT_METER_ID_ESC_MOTOR_4: currentMeterId_e = 63;
pub const currentMeterId_e_CURRENT_METER_ID_ESC_MOTOR_5: currentMeterId_e = 64;
pub const currentMeterId_e_CURRENT_METER_ID_ESC_MOTOR_6: currentMeterId_e = 65;
pub const currentMeterId_e_CURRENT_METER_ID_ESC_MOTOR_7: currentMeterId_e = 66;
pub const currentMeterId_e_CURRENT_METER_ID_ESC_MOTOR_8: currentMeterId_e = 67;
pub const currentMeterId_e_CURRENT_METER_ID_ESC_MOTOR_9: currentMeterId_e = 68;
pub const currentMeterId_e_CURRENT_METER_ID_ESC_MOTOR_10: currentMeterId_e = 69;
pub const currentMeterId_e_CURRENT_METER_ID_ESC_MOTOR_11: currentMeterId_e = 70;
pub const currentMeterId_e_CURRENT_METER_ID_ESC_MOTOR_12: currentMeterId_e = 71;
pub const currentMeterId_e_CURRENT_METER_ID_ESC_MOTOR_20: currentMeterId_e = 79;
pub const currentMeterId_e_CURRENT_METER_ID_VIRTUAL_1: currentMeterId_e = 80;
pub const currentMeterId_e_CURRENT_METER_ID_VIRTUAL_2: currentMeterId_e = 81;
pub const currentMeterId_e_CURRENT_METER_ID_MSP_1: currentMeterId_e = 90;
pub const currentMeterId_e_CURRENT_METER_ID_MSP_2: currentMeterId_e = 91;
pub type currentMeterId_e = ::std::os::raw::c_uint;
pub const currentMeterSource_e_CURRENT_METER_NONE: currentMeterSource_e = 0;
pub const currentMeterSource_e_CURRENT_METER_ADC: currentMeterSource_e = 1;
pub const currentMeterSource_e_CURRENT_METER_VIRTUAL: currentMeterSource_e = 2;
pub const currentMeterSource_e_CURRENT_METER_ESC: currentMeterSource_e = 3;
pub const currentMeterSource_e_CURRENT_METER_MSP: currentMeterSource_e = 4;
pub const currentMeterSource_e_CURRENT_METER_COUNT: currentMeterSource_e = 5;
pub type currentMeterSource_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct currentMeter_s {
    pub amperage: i32,
    pub amperageLatest: i32,
    pub mAhDrawn: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of currentMeter_s"][::std::mem::size_of::<currentMeter_s>() - 12usize];
    ["Alignment of currentMeter_s"][::std::mem::align_of::<currentMeter_s>() - 4usize];
    ["Offset of field: currentMeter_s::amperage"]
        [::std::mem::offset_of!(currentMeter_s, amperage) - 0usize];
    ["Offset of field: currentMeter_s::amperageLatest"]
        [::std::mem::offset_of!(currentMeter_s, amperageLatest) - 4usize];
    ["Offset of field: currentMeter_s::mAhDrawn"]
        [::std::mem::offset_of!(currentMeter_s, mAhDrawn) - 8usize];
};
pub type currentMeter_t = currentMeter_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct currentMeterMAhDrawnState_s {
    pub mAhDrawn: i32,
    pub mAhDrawnF: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of currentMeterMAhDrawnState_s"]
        [::std::mem::size_of::<currentMeterMAhDrawnState_s>() - 8usize];
    ["Alignment of currentMeterMAhDrawnState_s"]
        [::std::mem::align_of::<currentMeterMAhDrawnState_s>() - 4usize];
    ["Offset of field: currentMeterMAhDrawnState_s::mAhDrawn"]
        [::std::mem::offset_of!(currentMeterMAhDrawnState_s, mAhDrawn) - 0usize];
    ["Offset of field: currentMeterMAhDrawnState_s::mAhDrawnF"]
        [::std::mem::offset_of!(currentMeterMAhDrawnState_s, mAhDrawnF) - 4usize];
};
pub type currentMeterMAhDrawnState_t = currentMeterMAhDrawnState_s;
pub const currentSensor_e_CURRENT_SENSOR_VIRTUAL: currentSensor_e = 0;
pub const currentSensor_e_CURRENT_SENSOR_ADC: currentSensor_e = 1;
pub const currentSensor_e_CURRENT_SENSOR_ESC: currentSensor_e = 2;
pub const currentSensor_e_CURRENT_SENSOR_MSP: currentSensor_e = 3;
pub type currentSensor_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct currentMeterADCState_s {
    pub mahDrawnState: currentMeterMAhDrawnState_t,
    pub amperage: i32,
    pub amperageLatest: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of currentMeterADCState_s"][::std::mem::size_of::<currentMeterADCState_s>() - 16usize];
    ["Alignment of currentMeterADCState_s"]
        [::std::mem::align_of::<currentMeterADCState_s>() - 4usize];
    ["Offset of field: currentMeterADCState_s::mahDrawnState"]
        [::std::mem::offset_of!(currentMeterADCState_s, mahDrawnState) - 0usize];
    ["Offset of field: currentMeterADCState_s::amperage"]
        [::std::mem::offset_of!(currentMeterADCState_s, amperage) - 8usize];
    ["Offset of field: currentMeterADCState_s::amperageLatest"]
        [::std::mem::offset_of!(currentMeterADCState_s, amperageLatest) - 12usize];
};
pub type currentMeterADCState_t = currentMeterADCState_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct currentSensorADCConfig_s {
    pub scale: i16,
    pub offset: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of currentSensorADCConfig_s"]
        [::std::mem::size_of::<currentSensorADCConfig_s>() - 4usize];
    ["Alignment of currentSensorADCConfig_s"]
        [::std::mem::align_of::<currentSensorADCConfig_s>() - 2usize];
    ["Offset of field: currentSensorADCConfig_s::scale"]
        [::std::mem::offset_of!(currentSensorADCConfig_s, scale) - 0usize];
    ["Offset of field: currentSensorADCConfig_s::offset"]
        [::std::mem::offset_of!(currentSensorADCConfig_s, offset) - 2usize];
};
pub type currentSensorADCConfig_t = currentSensorADCConfig_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct currentMeterVirtualState_s {
    pub mahDrawnState: currentMeterMAhDrawnState_t,
    pub amperage: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of currentMeterVirtualState_s"]
        [::std::mem::size_of::<currentMeterVirtualState_s>() - 12usize];
    ["Alignment of currentMeterVirtualState_s"]
        [::std::mem::align_of::<currentMeterVirtualState_s>() - 4usize];
    ["Offset of field: currentMeterVirtualState_s::mahDrawnState"]
        [::std::mem::offset_of!(currentMeterVirtualState_s, mahDrawnState) - 0usize];
    ["Offset of field: currentMeterVirtualState_s::amperage"]
        [::std::mem::offset_of!(currentMeterVirtualState_s, amperage) - 8usize];
};
pub type currentSensorVirtualState_t = currentMeterVirtualState_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct currentSensorVirtualConfig_s {
    pub scale: i16,
    pub offset: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of currentSensorVirtualConfig_s"]
        [::std::mem::size_of::<currentSensorVirtualConfig_s>() - 4usize];
    ["Alignment of currentSensorVirtualConfig_s"]
        [::std::mem::align_of::<currentSensorVirtualConfig_s>() - 2usize];
    ["Offset of field: currentSensorVirtualConfig_s::scale"]
        [::std::mem::offset_of!(currentSensorVirtualConfig_s, scale) - 0usize];
    ["Offset of field: currentSensorVirtualConfig_s::offset"]
        [::std::mem::offset_of!(currentSensorVirtualConfig_s, offset) - 2usize];
};
pub type currentSensorVirtualConfig_t = currentSensorVirtualConfig_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct currentMeterESCState_s {
    pub mAhDrawn: i32,
    pub amperage: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of currentMeterESCState_s"][::std::mem::size_of::<currentMeterESCState_s>() - 8usize];
    ["Alignment of currentMeterESCState_s"]
        [::std::mem::align_of::<currentMeterESCState_s>() - 4usize];
    ["Offset of field: currentMeterESCState_s::mAhDrawn"]
        [::std::mem::offset_of!(currentMeterESCState_s, mAhDrawn) - 0usize];
    ["Offset of field: currentMeterESCState_s::amperage"]
        [::std::mem::offset_of!(currentMeterESCState_s, amperage) - 4usize];
};
pub type currentMeterESCState_t = currentMeterESCState_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct currentMeterMSPState_s {
    pub mAhDrawn: i32,
    pub amperage: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of currentMeterMSPState_s"][::std::mem::size_of::<currentMeterMSPState_s>() - 8usize];
    ["Alignment of currentMeterMSPState_s"]
        [::std::mem::align_of::<currentMeterMSPState_s>() - 4usize];
    ["Offset of field: currentMeterMSPState_s::mAhDrawn"]
        [::std::mem::offset_of!(currentMeterMSPState_s, mAhDrawn) - 0usize];
    ["Offset of field: currentMeterMSPState_s::amperage"]
        [::std::mem::offset_of!(currentMeterMSPState_s, amperage) - 4usize];
};
pub type currentMeterMSPState_t = currentMeterMSPState_s;
pub const voltageMeterId_e_VOLTAGE_METER_ID_NONE: voltageMeterId_e = 0;
pub const voltageMeterId_e_VOLTAGE_METER_ID_BATTERY_1: voltageMeterId_e = 10;
pub const voltageMeterId_e_VOLTAGE_METER_ID_BATTERY_2: voltageMeterId_e = 11;
pub const voltageMeterId_e_VOLTAGE_METER_ID_BATTERY_10: voltageMeterId_e = 19;
pub const voltageMeterId_e_VOLTAGE_METER_ID_5V_1: voltageMeterId_e = 20;
pub const voltageMeterId_e_VOLTAGE_METER_ID_5V_2: voltageMeterId_e = 21;
pub const voltageMeterId_e_VOLTAGE_METER_ID_5V_10: voltageMeterId_e = 29;
pub const voltageMeterId_e_VOLTAGE_METER_ID_9V_1: voltageMeterId_e = 30;
pub const voltageMeterId_e_VOLTAGE_METER_ID_9V_2: voltageMeterId_e = 31;
pub const voltageMeterId_e_VOLTAGE_METER_ID_9V_10: voltageMeterId_e = 39;
pub const voltageMeterId_e_VOLTAGE_METER_ID_12V_1: voltageMeterId_e = 40;
pub const voltageMeterId_e_VOLTAGE_METER_ID_12V_2: voltageMeterId_e = 41;
pub const voltageMeterId_e_VOLTAGE_METER_ID_12V_10: voltageMeterId_e = 49;
pub const voltageMeterId_e_VOLTAGE_METER_ID_ESC_COMBINED_1: voltageMeterId_e = 50;
pub const voltageMeterId_e_VOLTAGE_METER_ID_ESC_COMBINED_10: voltageMeterId_e = 59;
pub const voltageMeterId_e_VOLTAGE_METER_ID_ESC_MOTOR_1: voltageMeterId_e = 60;
pub const voltageMeterId_e_VOLTAGE_METER_ID_ESC_MOTOR_2: voltageMeterId_e = 61;
pub const voltageMeterId_e_VOLTAGE_METER_ID_ESC_MOTOR_3: voltageMeterId_e = 62;
pub const voltageMeterId_e_VOLTAGE_METER_ID_ESC_MOTOR_4: voltageMeterId_e = 63;
pub const voltageMeterId_e_VOLTAGE_METER_ID_ESC_MOTOR_5: voltageMeterId_e = 64;
pub const voltageMeterId_e_VOLTAGE_METER_ID_ESC_MOTOR_6: voltageMeterId_e = 65;
pub const voltageMeterId_e_VOLTAGE_METER_ID_ESC_MOTOR_7: voltageMeterId_e = 66;
pub const voltageMeterId_e_VOLTAGE_METER_ID_ESC_MOTOR_8: voltageMeterId_e = 67;
pub const voltageMeterId_e_VOLTAGE_METER_ID_ESC_MOTOR_9: voltageMeterId_e = 68;
pub const voltageMeterId_e_VOLTAGE_METER_ID_ESC_MOTOR_10: voltageMeterId_e = 69;
pub const voltageMeterId_e_VOLTAGE_METER_ID_ESC_MOTOR_11: voltageMeterId_e = 70;
pub const voltageMeterId_e_VOLTAGE_METER_ID_ESC_MOTOR_12: voltageMeterId_e = 71;
pub const voltageMeterId_e_VOLTAGE_METER_ID_ESC_MOTOR_20: voltageMeterId_e = 79;
pub const voltageMeterId_e_VOLTAGE_METER_ID_CELL_1: voltageMeterId_e = 80;
pub const voltageMeterId_e_VOLTAGE_METER_ID_CELL_2: voltageMeterId_e = 81;
pub const voltageMeterId_e_VOLTAGE_METER_ID_CELL_40: voltageMeterId_e = 119;
pub type voltageMeterId_e = ::std::os::raw::c_uint;
pub const voltageMeterSource_e_VOLTAGE_METER_NONE: voltageMeterSource_e = 0;
pub const voltageMeterSource_e_VOLTAGE_METER_ADC: voltageMeterSource_e = 1;
pub const voltageMeterSource_e_VOLTAGE_METER_ESC: voltageMeterSource_e = 2;
pub const voltageMeterSource_e_VOLTAGE_METER_COUNT: voltageMeterSource_e = 3;
pub type voltageMeterSource_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct voltageMeter_s {
    pub displayFiltered: u16,
    pub unfiltered: u16,
    pub sagFiltered: u16,
    pub lowVoltageCutoff: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of voltageMeter_s"][::std::mem::size_of::<voltageMeter_s>() - 8usize];
    ["Alignment of voltageMeter_s"][::std::mem::align_of::<voltageMeter_s>() - 2usize];
    ["Offset of field: voltageMeter_s::displayFiltered"]
        [::std::mem::offset_of!(voltageMeter_s, displayFiltered) - 0usize];
    ["Offset of field: voltageMeter_s::unfiltered"]
        [::std::mem::offset_of!(voltageMeter_s, unfiltered) - 2usize];
    ["Offset of field: voltageMeter_s::sagFiltered"]
        [::std::mem::offset_of!(voltageMeter_s, sagFiltered) - 4usize];
    ["Offset of field: voltageMeter_s::lowVoltageCutoff"]
        [::std::mem::offset_of!(voltageMeter_s, lowVoltageCutoff) - 6usize];
};
pub type voltageMeter_t = voltageMeter_s;
pub const voltageSensorType_e_VOLTAGE_SENSOR_TYPE_ADC_RESISTOR_DIVIDER: voltageSensorType_e = 0;
pub const voltageSensorType_e_VOLTAGE_SENSOR_TYPE_ESC: voltageSensorType_e = 1;
pub type voltageSensorType_e = ::std::os::raw::c_uint;
pub const voltageSensorADC_e_VOLTAGE_SENSOR_ADC_VBAT: voltageSensorADC_e = 0;
pub const voltageSensorADC_e_VOLTAGE_SENSOR_ADC_12V: voltageSensorADC_e = 1;
pub const voltageSensorADC_e_VOLTAGE_SENSOR_ADC_9V: voltageSensorADC_e = 2;
pub const voltageSensorADC_e_VOLTAGE_SENSOR_ADC_5V: voltageSensorADC_e = 3;
pub type voltageSensorADC_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct voltageSensorADCConfig_s {
    pub vbatscale: u8,
    pub vbatresdivval: u8,
    pub vbatresdivmultiplier: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of voltageSensorADCConfig_s"]
        [::std::mem::size_of::<voltageSensorADCConfig_s>() - 3usize];
    ["Alignment of voltageSensorADCConfig_s"]
        [::std::mem::align_of::<voltageSensorADCConfig_s>() - 1usize];
    ["Offset of field: voltageSensorADCConfig_s::vbatscale"]
        [::std::mem::offset_of!(voltageSensorADCConfig_s, vbatscale) - 0usize];
    ["Offset of field: voltageSensorADCConfig_s::vbatresdivval"]
        [::std::mem::offset_of!(voltageSensorADCConfig_s, vbatresdivval) - 1usize];
    ["Offset of field: voltageSensorADCConfig_s::vbatresdivmultiplier"]
        [::std::mem::offset_of!(voltageSensorADCConfig_s, vbatresdivmultiplier) - 2usize];
};
pub type voltageSensorADCConfig_t = voltageSensorADCConfig_s;
pub const AUTO_PROFILE_CELL_COUNT_STAY: _bindgen_ty_1 = 0;
pub const AUTO_PROFILE_CELL_COUNT_CHANGE: _bindgen_ty_1 = -1;
pub type _bindgen_ty_1 = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct batteryConfig_s {
    pub vbatmaxcellvoltage: u16,
    pub vbatmincellvoltage: u16,
    pub vbatwarningcellvoltage: u16,
    pub vbatnotpresentcellvoltage: u16,
    pub lvcPercentage: u8,
    pub voltageMeterSource: voltageMeterSource_e,
    pub currentMeterSource: currentMeterSource_e,
    pub batteryCapacity: u16,
    pub useVBatAlerts: bool,
    pub useConsumptionAlerts: bool,
    pub consumptionWarningPercentage: u8,
    pub vbathysteresis: u8,
    pub vbatfullcellvoltage: u16,
    pub forceBatteryCellCount: u8,
    pub vbatDisplayLpfPeriod: u8,
    pub ibatLpfPeriod: u8,
    pub vbatDurationForWarning: u8,
    pub vbatDurationForCritical: u8,
    pub vbatSagLpfPeriod: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of batteryConfig_s"][::std::mem::size_of::<batteryConfig_s>() - 36usize];
    ["Alignment of batteryConfig_s"][::std::mem::align_of::<batteryConfig_s>() - 4usize];
    ["Offset of field: batteryConfig_s::vbatmaxcellvoltage"]
        [::std::mem::offset_of!(batteryConfig_s, vbatmaxcellvoltage) - 0usize];
    ["Offset of field: batteryConfig_s::vbatmincellvoltage"]
        [::std::mem::offset_of!(batteryConfig_s, vbatmincellvoltage) - 2usize];
    ["Offset of field: batteryConfig_s::vbatwarningcellvoltage"]
        [::std::mem::offset_of!(batteryConfig_s, vbatwarningcellvoltage) - 4usize];
    ["Offset of field: batteryConfig_s::vbatnotpresentcellvoltage"]
        [::std::mem::offset_of!(batteryConfig_s, vbatnotpresentcellvoltage) - 6usize];
    ["Offset of field: batteryConfig_s::lvcPercentage"]
        [::std::mem::offset_of!(batteryConfig_s, lvcPercentage) - 8usize];
    ["Offset of field: batteryConfig_s::voltageMeterSource"]
        [::std::mem::offset_of!(batteryConfig_s, voltageMeterSource) - 12usize];
    ["Offset of field: batteryConfig_s::currentMeterSource"]
        [::std::mem::offset_of!(batteryConfig_s, currentMeterSource) - 16usize];
    ["Offset of field: batteryConfig_s::batteryCapacity"]
        [::std::mem::offset_of!(batteryConfig_s, batteryCapacity) - 20usize];
    ["Offset of field: batteryConfig_s::useVBatAlerts"]
        [::std::mem::offset_of!(batteryConfig_s, useVBatAlerts) - 22usize];
    ["Offset of field: batteryConfig_s::useConsumptionAlerts"]
        [::std::mem::offset_of!(batteryConfig_s, useConsumptionAlerts) - 23usize];
    ["Offset of field: batteryConfig_s::consumptionWarningPercentage"]
        [::std::mem::offset_of!(batteryConfig_s, consumptionWarningPercentage) - 24usize];
    ["Offset of field: batteryConfig_s::vbathysteresis"]
        [::std::mem::offset_of!(batteryConfig_s, vbathysteresis) - 25usize];
    ["Offset of field: batteryConfig_s::vbatfullcellvoltage"]
        [::std::mem::offset_of!(batteryConfig_s, vbatfullcellvoltage) - 26usize];
    ["Offset of field: batteryConfig_s::forceBatteryCellCount"]
        [::std::mem::offset_of!(batteryConfig_s, forceBatteryCellCount) - 28usize];
    ["Offset of field: batteryConfig_s::vbatDisplayLpfPeriod"]
        [::std::mem::offset_of!(batteryConfig_s, vbatDisplayLpfPeriod) - 29usize];
    ["Offset of field: batteryConfig_s::ibatLpfPeriod"]
        [::std::mem::offset_of!(batteryConfig_s, ibatLpfPeriod) - 30usize];
    ["Offset of field: batteryConfig_s::vbatDurationForWarning"]
        [::std::mem::offset_of!(batteryConfig_s, vbatDurationForWarning) - 31usize];
    ["Offset of field: batteryConfig_s::vbatDurationForCritical"]
        [::std::mem::offset_of!(batteryConfig_s, vbatDurationForCritical) - 32usize];
    ["Offset of field: batteryConfig_s::vbatSagLpfPeriod"]
        [::std::mem::offset_of!(batteryConfig_s, vbatSagLpfPeriod) - 33usize];
};
pub type batteryConfig_t = batteryConfig_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lowVoltageCutoff_s {
    pub enabled: bool,
    pub percentage: u8,
    pub startTime: timeUs_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lowVoltageCutoff_s"][::std::mem::size_of::<lowVoltageCutoff_s>() - 8usize];
    ["Alignment of lowVoltageCutoff_s"][::std::mem::align_of::<lowVoltageCutoff_s>() - 4usize];
    ["Offset of field: lowVoltageCutoff_s::enabled"]
        [::std::mem::offset_of!(lowVoltageCutoff_s, enabled) - 0usize];
    ["Offset of field: lowVoltageCutoff_s::percentage"]
        [::std::mem::offset_of!(lowVoltageCutoff_s, percentage) - 1usize];
    ["Offset of field: lowVoltageCutoff_s::startTime"]
        [::std::mem::offset_of!(lowVoltageCutoff_s, startTime) - 4usize];
};
pub type lowVoltageCutoff_t = lowVoltageCutoff_s;
pub const batteryState_e_BATTERY_OK: batteryState_e = 0;
pub const batteryState_e_BATTERY_WARNING: batteryState_e = 1;
pub const batteryState_e_BATTERY_CRITICAL: batteryState_e = 2;
pub const batteryState_e_BATTERY_NOT_PRESENT: batteryState_e = 3;
pub const batteryState_e_BATTERY_INIT: batteryState_e = 4;
pub type batteryState_e = ::std::os::raw::c_uint;
pub const sensorIndex_e_SENSOR_INDEX_GYRO: sensorIndex_e = 0;
pub const sensorIndex_e_SENSOR_INDEX_ACC: sensorIndex_e = 1;
pub const sensorIndex_e_SENSOR_INDEX_BARO: sensorIndex_e = 2;
pub const sensorIndex_e_SENSOR_INDEX_MAG: sensorIndex_e = 3;
pub const sensorIndex_e_SENSOR_INDEX_RANGEFINDER: sensorIndex_e = 4;
pub const sensorIndex_e_SENSOR_INDEX_COUNT: sensorIndex_e = 5;
pub type sensorIndex_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct int16_flightDynamicsTrims_s {
    pub roll: i16,
    pub pitch: i16,
    pub yaw: i16,
    pub calibrationCompleted: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of int16_flightDynamicsTrims_s"]
        [::std::mem::size_of::<int16_flightDynamicsTrims_s>() - 8usize];
    ["Alignment of int16_flightDynamicsTrims_s"]
        [::std::mem::align_of::<int16_flightDynamicsTrims_s>() - 2usize];
    ["Offset of field: int16_flightDynamicsTrims_s::roll"]
        [::std::mem::offset_of!(int16_flightDynamicsTrims_s, roll) - 0usize];
    ["Offset of field: int16_flightDynamicsTrims_s::pitch"]
        [::std::mem::offset_of!(int16_flightDynamicsTrims_s, pitch) - 2usize];
    ["Offset of field: int16_flightDynamicsTrims_s::yaw"]
        [::std::mem::offset_of!(int16_flightDynamicsTrims_s, yaw) - 4usize];
    ["Offset of field: int16_flightDynamicsTrims_s::calibrationCompleted"]
        [::std::mem::offset_of!(int16_flightDynamicsTrims_s, calibrationCompleted) - 6usize];
};
pub type flightDynamicsTrims_def_t = int16_flightDynamicsTrims_s;
#[repr(C)]
#[derive(Copy, Clone)]
pub union flightDynamicsTrims_u {
    pub raw: [i16; 4usize],
    pub values: flightDynamicsTrims_def_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of flightDynamicsTrims_u"][::std::mem::size_of::<flightDynamicsTrims_u>() - 8usize];
    ["Alignment of flightDynamicsTrims_u"]
        [::std::mem::align_of::<flightDynamicsTrims_u>() - 2usize];
    ["Offset of field: flightDynamicsTrims_u::raw"]
        [::std::mem::offset_of!(flightDynamicsTrims_u, raw) - 0usize];
    ["Offset of field: flightDynamicsTrims_u::values"]
        [::std::mem::offset_of!(flightDynamicsTrims_u, values) - 0usize];
};
pub type flightDynamicsTrims_t = flightDynamicsTrims_u;
pub const sensors_e_SENSOR_GYRO: sensors_e = 1;
pub const sensors_e_SENSOR_ACC: sensors_e = 2;
pub const sensors_e_SENSOR_BARO: sensors_e = 4;
pub const sensors_e_SENSOR_MAG: sensors_e = 8;
pub const sensors_e_SENSOR_SONAR: sensors_e = 16;
pub const sensors_e_SENSOR_RANGEFINDER: sensors_e = 16;
pub const sensors_e_SENSOR_GPS: sensors_e = 32;
pub const sensors_e_SENSOR_GPSMAG: sensors_e = 64;
pub type sensors_e = ::std::os::raw::c_uint;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 48usize];
    ["Alignment of random_data"][::std::mem::align_of::<random_data>() - 8usize];
    ["Offset of field: random_data::fptr"][::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::std::mem::offset_of!(random_data, rptr) - 8usize];
    ["Offset of field: random_data::state"][::std::mem::offset_of!(random_data, state) - 16usize];
    ["Offset of field: random_data::rand_type"]
        [::std::mem::offset_of!(random_data, rand_type) - 24usize];
    ["Offset of field: random_data::rand_deg"]
        [::std::mem::offset_of!(random_data, rand_deg) - 28usize];
    ["Offset of field: random_data::rand_sep"]
        [::std::mem::offset_of!(random_data, rand_sep) - 32usize];
    ["Offset of field: random_data::end_ptr"]
        [::std::mem::offset_of!(random_data, end_ptr) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::std::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"][::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"]
        [::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"][::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FCInput {
    pub voltage: f32,
    pub sagged_voltage: f32,
    pub amperage: f64,
    pub mah_drawn: f64,
    pub cell_count: u8,
    pub attitude: [f32; 4usize],
    pub acceleration: [f32; 3usize],
    pub angular_velocity: [f32; 3usize],
    pub rc_data: [f32; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FCInput"][::std::mem::size_of::<FCInput>() - 104usize];
    ["Alignment of FCInput"][::std::mem::align_of::<FCInput>() - 8usize];
    ["Offset of field: FCInput::voltage"][::std::mem::offset_of!(FCInput, voltage) - 0usize];
    ["Offset of field: FCInput::sagged_voltage"]
        [::std::mem::offset_of!(FCInput, sagged_voltage) - 4usize];
    ["Offset of field: FCInput::amperage"][::std::mem::offset_of!(FCInput, amperage) - 8usize];
    ["Offset of field: FCInput::mah_drawn"][::std::mem::offset_of!(FCInput, mah_drawn) - 16usize];
    ["Offset of field: FCInput::cell_count"][::std::mem::offset_of!(FCInput, cell_count) - 24usize];
    ["Offset of field: FCInput::attitude"][::std::mem::offset_of!(FCInput, attitude) - 28usize];
    ["Offset of field: FCInput::acceleration"]
        [::std::mem::offset_of!(FCInput, acceleration) - 44usize];
    ["Offset of field: FCInput::angular_velocity"]
        [::std::mem::offset_of!(FCInput, angular_velocity) - 56usize];
    ["Offset of field: FCInput::rc_data"][::std::mem::offset_of!(FCInput, rc_data) - 68usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_data {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lws_context {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lws {
    pub _address: u8,
}
pub struct Sitl {
    __library: ::libloading::Library,
    pub debug: Result<*mut [i16; 8usize], ::libloading::Error>,
    pub debugMode: Result<*mut u8, ::libloading::Error>,
    pub debugModeNames: Result<*mut [*const ::std::os::raw::c_char; 91usize], ::libloading::Error>,
    pub debugInit: Result<unsafe extern "C" fn(), ::libloading::Error>,
    pub gcd: Result<
        unsafe extern "C" fn(
            num: ::std::os::raw::c_int,
            denom: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
        ::libloading::Error,
    >,
    pub applyDeadband:
